[
  {
    "semno": "3",
    "branchname": "Computer Science Engineering",
    "subjno": "6",
    "labno": "2",
    "subj1": "Engineering Mathematics - III",
    "sub1code": "17MAT31",
    "subj2": "ANALOG AND DIGITAL ELECTRONICS",
    "sub2code": "17CS32",
    "subj3": "DATA STRUCTURES AND APPLICATIONS",
    "sub3code": "17CS33",
    "subj4": "COMPUTER ORGANIZATION",
    "sub4code": "17CS34",
    "subj5": "UNIX AND SHELL PROGRAMMING",
    "sub5code": "17CS35",
    "subj6": "DISCRETE MATHEMATICAL STRUCTURES",
    "sub6code": "17CS36",

    "labname1": "MATERIALS TESTING LAB",
    "lab1code": "17MEL37A",
    "labname2": "MECHANICAL MEASUREMENTS AND METROLOGY LAB",
    "lab2code": "17MEL37B",
    "labname3": "FOUNDRY AND FORGING LAB",
    "lab3code": "17MEL38A",
    "labname4": "MACHINE SHOP",
    "lab4code": "17MEL38B",

    "subj1data": [
      {
        "_id": "5ed6619726a0e62580ac6dc8",
        "subcode": "17MAT31",
        "subname": "ENGINEERING MATHEMATICS-III",
        "moduledesc": [
          {
            "m": "Module 1",
            "mdesc": "Fourier Series:\n Periodic functions, Dirichlet’s condition, Fourier Series of periodic functions with period 2π and with arbitrary period 2c. Fourier series of even and odd functions. Half range Fourier Series, practical harmonic analysis-Illustrative examples from engineering field."
          },
          {
            "m": "Module 2",
            "mdesc": "Fourier Transforms:\n Infinite Fourier transforms, Fourier sine and cosine transforms. Inverse Fouriertransform.\n\nZ-transform:\n Difference equations, basic definition, z-transform-definition, Standard z-transforms,Damping rule, Shifting rule, Initial value and final value theorems (without proof) and problems,Inverse z-transform. Applications of z-transforms to solve difference equations."
          },
          {
            "m": "Module 3",
            "mdesc": "Statistical Methods:\n Review of measures of central tendency and dispersion. Correlation-KarlPearson’s coefficient of correlation-problems. Regression analysis- lines of regression (withoutproof) –problems\n\nCurve Fitting:\n Curve fitting by the method of least squares- fitting of the curves of the form,\n y = ax+ b, y = ax2\n+ bx + c and y = aebx.\n\nNumerical Methods:\n Numerical solution of algebraic and transcendental equations by Regula- FalsiMethod and Newton-Raphson method."
          },
          {
            "m": "Module 4",
            "mdesc": "Finite differences:\n Forward and backward differences, Newton’s forward and backward interpolation formulae. Divided differences- Newton’s divided difference formula. Lagrange’s interpolation formula and inverse interpolation formula (all formulae without proof)-Problems.\n\nNumerical integration:\n Simpson’s (1/3)th and (3/8)th rules, Weddle’s rule (without proof ) –Problems."
          },
          {
            "m": "Module 5",
            "mdesc": "Vector integration:\n Line integrals-definition and problems, surface and volume integrals-definition,Green’s theorem in a plane, Stokes and Gauss-divergence theorem(without proof) and problems.\n\nCalculus of Variations:\n Variation of function and Functional, variational problems. Euler’s equation, Geodesics, hanging chain, problems."
          }
        ],
        "descname": "Prescribed Text books",
        "descdata": "Text Books:\n1. B. S. Grewal, Higher Engineering Mathematics, Khanna publishers, 42nd edition, 2013.\n2. B.V. Ramana Higher Engineering Mathematics Tata McGraw-Hill,2006.\n\nReference Books:\n1. N. P. Bali and Manish Goyal, A text book of Engineering mathematics , Laxmi publications, latestedition.\n2. Kreyszig, Advanced Engineering Mathematics  - 9th edition, Wiley.\n3. H. K Dass and Er. Rajnish Verma ,Higher Engineering Mathematics, S. Chand, 1st ed.",
        "notesurl": "https://adityam945.github.io/cse-json-files/",
        "notesscreenname": "NotesListFile",
        "notesscreenparams": "17mat31notes.json",
        "qpscreentype": "QPaperListFile",
        "qpurl": "https://adityam945.github.io/cse-json-files/",
        "qpscreenparams": "17mat31qp.json",
        "qbscreentype": "QBankListFile",
        "qburl": "https://adityam945.github.io/cse-json-files/",
        "qbscreenparams": "17mat31qb.json"
      }
    ],
    "subj2data": [
      {
        "_id": "5ed6619726a0e62580ac6dc8",
        "subcode": "17CS32",
        "subname": "ANALOG AND DIGITAL ELECTRONICS",
        "moduledesc": [
          {
            "m": "Module 1",
            "mdesc": "Field Effect Transistors:\n Junction Field Effect Transistors, MOSFETs, Differences between JFETs and MOSFETs, Biasing MOSFETs, FET Applications, CMOS Devices.\n\n Wave-Shaping Circuits:\n Integrated Circuit(IC) Multivibrators.\n\n Introduction to Operational Amplifier:\n Ideal v/s practical Opamp, Performance Parameters.\n\n Operational Amplifier Application Circits:\n Peak Detector Circuit, Comparator, Active Filters, Non-Linear Amplifier, Relaxation Oscillator, Current-ToVoltage Converter, Voltage-To-Current Converter."
          },
          {
            "m": "Module 2",
            "mdesc": "The Basic Gates:\n Review of Basic Logic gates, Positive and Negative Logic, Introduction to HDL.\n\n Combinational Logic Circuits:\n Sum-of-Products Method, Truth Table to Karnaugh Map, Pairs Quads, and Octets, Karnaugh Simplifications, Don’t-care Conditions, Product-of-sums Method, Product-of-sums simplifications, Simplification by Quine-McClusky Method, Hazards and Hazard covers, HDL Implementation Models."
          },
          {
            "m": "Module 3",
            "mdesc": "Data-Processing Circuits:\n Multiplexers, Demultiplexers, 1-of-16 Decoder, BCD to Decimal Decoders, Seven Segment Decoders, Encoders, Exclusive-OR Gates, Parity Generators and Checkers, Magnitude Comparator, Programmable Array Logic, Programmable Logic Arrays, HDL Implementation of Data Processing Circuits. Arithmetic Building Blocks,\n\n Arithmetic Logic Unit Flip- Flops:\n RS Flip-Flops, Gated Flip-Flops, Edge-triggered RS FLIP-FLOP, Edge-triggered D FLIP-FLOPs, Edge-triggered JK FLIP-FLOPs. "
          },
          {
            "m": "Module 4",
            "mdesc": "Flip- Flops:\n FLIP-FLOP Timing, JK Master-slave FLIP-FLOP, Switch Contact Bounce Circuits, Various Representation of FLIP-FLOPs, HDL Implementation of FLIP-FLOP.\n\n Registers:\n Types of Registers, Serial In - Serial Out, Serial In - Parallel out, Parallel In - Serial Out, Parallel In - Parallel Out, Universal Shift Register, Applications of Shift Registers, Register implementation in HDL.\n\n Counters:\n Asynchronous Counters, Decoding Gates, Synchronous Counters, Changing the Counter Modulus.    "
          },
          {
            "m": "Module 5",
            "mdesc": "Counters:\n Decade Counters, Presettable Counters, Counter Design as a Synthesis problem, A Digital Clock, Counter Design using HDL.\n\n D/A Conversion and A/D Conversion:\n Variable, Resistor Networks, Binary Ladders, D/A Converters, D/A Accuracy and Resolution, A/D ConverterSimultaneous Conversion, A/D Converter-Counter Method, Continuous A/D Conversion, A/D Techniques, Dual-slope A/D Conversion, A/D Accuracy and Resolution. "
          }
        ],
        "descname": "Prescribed Text books",
        "descdata": "Text Books:\n1. B. S. Grewal, Higher Engineering Mathematics, Khanna publishers, 42nd edition, 2013.\n2. B.V. Ramana Higher Engineering Mathematics Tata McGraw-Hill,2006.\n\nReference Books:\n1. N. P. Bali and Manish Goyal, A text book of Engineering mathematics , Laxmi publications, latestedition.\n2. Kreyszig, Advanced Engineering Mathematics  - 9th edition, Wiley.\n3. H. K Dass and Er. Rajnish Verma ,Higher Engineering Mathematics, S. Chand, 1st ed.",
        "notesurl": "https://adityam945.github.io/cse-json-files/",
        "notesscreenname": "NotesListFile",
        "notesscreenparams": "17mat31notes.json",
        "qpscreentype": "QPaperListFile",
        "qpurl": "https://adityam945.github.io/cse-json-files/",
        "qpscreenparams": "17mat31qp.json",
        "qbscreentype": "QBankListFile",
        "qburl": "https://adityam945.github.io/cse-json-files/",
        "qbscreenparams": "17mat31qb.json"
      }
    ],

    "subj3data": [
      {
        "_id": "5ed6619726a0e62580ac6dc8",
        "subcode": "17CS33",
        "subname": "DATA STRUCTURES AND APPLICATIONS",
        "moduledesc": [
          {
            "m": "Module 1",
            "mdesc": "Introduction:\n Data Structures, Classifications (Primitive & Non Primitive), Data structure Operations, Review of Arrays, Structures, Self-Referential Structures, and Unions. Pointers and Dynamic Memory Allocation Functions. Representation of Linear Arrays in Memory, Dynamically allocated arrays,\n\n Array Operations:\n Traversing, inserting, deleting, searching, and sorting. Multidimensional Arrays, Polynomials and Sparse Matrices.\n\n Strings:\n Basic Terminology, Storing, Operations and Pattern Matching algorithms. "
          },
          {
            "m": "Module 2",
            "mdesc": "Stacks:\n Definition, Stack Operations, Array Representation of Stacks, Stacks using Dynamic Arrays, Stack Applications: Polish notation, Infix to postfix conversion, evaluation of postfix expression,\n\n Recursion -\n Factorial, GCD, Fibonacci Sequence, Tower of Hanoi, Ackerman's function.\n\n Queues:\n Definition, Array Representation, Queue Operations, Circular Queues, Circular queues using Dynamic arrays, Dequeues, Priority Queues, A Mazing Problem. Multiple Stacks and Queues. "
          },
          {
            "m": "Module 3",
            "mdesc": "Linked Lists:\n Definition, Representation of linked lists in Memory, Memory allocation; Garbage Collection. Linked list operations: Traversing, Searching, Insertion, and Deletion. Doubly Linked lists, Circular linked lists, and header linked lists. Linked Stacks and Queues. Applications of Linked lists – Polynomials, Sparse matrix representation."
          },
          {
            "m": "Module 4",
            "mdesc": "Trees:\n Terminology, Binary Trees, Properties of Binary trees, Array and linked Representation of Binary Trees, Binary Tree Traversals - Inorder, postorder, preorder; Additional Binary tree operations. Threaded binary trees, Binary Search Trees – Definition, Insertion, Deletion, Traversal, Searching, Application of Trees-Evaluation of Expression, "
          },
          {
            "m": "Module 5",
            "mdesc": "Graphs:\n Definitions, Terminologies, Matrix and Adjacency List Representation Of Graphs, Elementary Graph operations, Traversal methods: Breadth First Search and Depth First Search.\n\n Sorting and Searching:\n Insertion Sort, Radix sort, Address Calculation Sort.\n\n Hashing:\n Hash Table organizations, Hashing Functions, Static and Dynamic Hashing.\n\n Files and Their Organization:\n Data Hierarchy, File Attributes, Text Files and Binary Files, Basic File Operations, File Organizations and Indexing"
          }
        ],
        "descname": "Prescribed Text books",
        "descdata": "Text Books:\n1. B. S. Grewal, Higher Engineering Mathematics, Khanna publishers, 42nd edition, 2013.\n2. B.V. Ramana Higher Engineering Mathematics Tata McGraw-Hill,2006.\n\nReference Books:\n1. N. P. Bali and Manish Goyal, A text book of Engineering mathematics , Laxmi publications, latestedition.\n2. Kreyszig, Advanced Engineering Mathematics  - 9th edition, Wiley.\n3. H. K Dass and Er. Rajnish Verma ,Higher Engineering Mathematics, S. Chand, 1st ed.",
        "notesurl": "https://adityam945.github.io/cse-json-files/",
        "notesscreenname": "NotesListFile",
        "notesscreenparams": "17mat31notes.json",
        "qpscreentype": "QPaperListFile",
        "qpurl": "https://adityam945.github.io/cse-json-files/",
        "qpscreenparams": "17mat31qp.json",
        "qbscreentype": "QBankListFile",
        "qburl": "https://adityam945.github.io/cse-json-files/",
        "qbscreenparams": "17mat31qb.json"
      }
    ],
    "subj4data": [
      {
        "_id": "5ed6619726a0e62580ac6dc8",
        "subcode": "17CS34",
        "subname": "COMPUTER ORGANIZATION",
        "moduledesc": [
          {
            "m": "Module 1",
            "mdesc": "Basic Structure of Computers:\n Basic Operational Concepts, Bus Structures, Performance – Processor Clock, Basic Performance Equation, Clock Rate, Performance Measurement.\n\n Machine Instructions and Programs:\n Memory Location and Addresses, Memory Operations, Instructions and Instruction Sequencing, Addressing Modes, Assembly Language, Basic Input and Output Operations, Stacks and Queues, Subroutines, Additional Instructions, Encoding of Machine Instructions "
          },
          {
            "m": "Module 2",
            "mdesc": "Input/Output Organization:\n Accessing I/O Devices, Interrupts – Interrupt Hardware, Enabling and Disabling Interrupts, Handling Multiple Devices, Controlling Device Requests, Exceptions, Direct Memory Access, Buses Interface Circuits, Standard I/O Interfaces – PCI Bus, SCSI Bus, USB. ."
          },
          {
            "m": "Module 3",
            "mdesc": "Memory System:\n  Basic Concepts, Semiconductor RAM Memories, Read Only Memories, Speed, Size, and Cost, Cache Memories – Mapping Functions, Replacement Algorithms, Performance Considerations, Virtual Memories, Secondary Storage.     "
          },
          {
            "m": "Module 4",
            "mdesc": "Arithmetic: \n Numbers, Arithmetic Operations and Characters, Addition and Subtraction of Signed Numbers, Design of Fast Adders, Multiplication of Positive Numbers, Signed Operand Multiplication, Fast Multiplication, Integer Division, Floating-point Numbers and Operations. "
          },
          {
            "m": "Module 5",
            "mdesc": "Basic Processing Unit:\n Some Fundamental Concepts, Execution of a Complete Instruction, Multiple Bus Organization, Hard-wired Control, Micro programmed Control. \n\nPipelining, Embedded Systems and Large Computer Systems: \nBasic Concepts of pipelining, Examples of Embedded Systems, Processor chips for embedded applications, Simple Microcontroller, The structure of General-Purpose Multiprocessors. "
          }
        ],
        "descname": "Prescribed Text books",
        "descdata": "Text Books:\n1. B. S. Grewal, Higher Engineering Mathematics, Khanna publishers, 42nd edition, 2013.\n2. B.V. Ramana Higher Engineering Mathematics Tata McGraw-Hill,2006.\n\nReference Books:\n1. N. P. Bali and Manish Goyal, A text book of Engineering mathematics , Laxmi publications, latestedition.\n2. Kreyszig, Advanced Engineering Mathematics  - 9th edition, Wiley.\n3. H. K Dass and Er. Rajnish Verma ,Higher Engineering Mathematics, S. Chand, 1st ed.",
        "notesurl": "https://adityam945.github.io/cse-json-files/",
        "notesscreenname": "NotesListFile",
        "notesscreenparams": "17mat31notes.json",
        "qpscreentype": "QPaperListFile",
        "qpurl": "https://adityam945.github.io/cse-json-files/",
        "qpscreenparams": "17mat31qp.json",
        "qbscreentype": "QBankListFile",
        "qburl": "https://adityam945.github.io/cse-json-files/",
        "qbscreenparams": "17mat31qb.json"
      }
    ],
    "subj5data": [
      {
        "_id": "5ed6619726a0e62580ac6dc8",
        "subcode": "17CS35",
        "subname": "UNIX AND SHELL PROGRAMMING",
        "moduledesc": [
          {
            "m": "Module 1",
            "mdesc": "Introduction, Brief history. Unix Components/Architecture. Features of Unix. The UNIX Environment and UNIX Structure, Posix and Single Unix specification.  The login prompt. General features of Unix commands/ command structure. Command arguments and options. Understanding of some basic commands such as echo, printf, ls, who, date, passwd, cal, Combining commands. Meaning of Internal and external commands. The type command: knowing the type of a command and locating it. The man command knowing more about Unix commands and using Unix online manual pages. The man with keyword option and whatis. The more command and using it with other commands. Knowing the user terminal, displaying its characteristics and setting characteristics. Managing the non-uniform behaviour of terminals and keyboards. The root login. Becoming the super user: su command. The /etc/passwd and /etc/shadow files. Commands to add, modify and delete users. "
          },
          {
            "m": "Module 2",
            "mdesc": "Unix files. Naming files. Basic file types/categories. Organization of files. Hidden files. Standard directories. Parent child relationship. The home directory and the HOME variable. \n\n Reaching required files- the PATH variable, manipulating the PATH, Relative and absolute pathnames.\n\n Directory commands – pwd, cd, mkdir, rmdir commands.\n The dot (.) and double dots (..) notations to represent present and parent directories and their usage in relative path names.  \n\nFile related commands – cat, mv, rm, cp, wc and od commands. File attributes and permissions and knowing them. The ls command with options.\n\n  Changing file permissions: the relative and absolute permissions changing methods. Recursively changing file permissions. Directory permissions. "
          },
          {
            "m": "Module 3",
            "mdesc": "The vi editor. Basics. The .exrc file.  Different ways of invoking and quitting vi. Different modes of vi. Input mode commands. Command mode commands. The ex mode commands. Illustrative examples Navigation commands. Repeat command. Pattern searching. The search and replace command. The set, map and abbr commands. Simple examples using these commands. \n\nThe shells interpretive cycle. Wild cards and file name generation. Removing the special meanings of wild cards. Three standard files and redirection. Connecting commands: Pipe. Splitting the output: tee. Command substitution. Basic and Extended regular expressions. The grep, egrep. Typical examples involving different regular expressions.  "
          },
          {
            "m": "Module 4",
            "mdesc": "Shell programming. Ordinary and environment variables. The .profile. Read and readonly commands. Command line arguments. exit and exit status of a command. Logical operators for conditional execution. The test command and its shortcut. The if, while, for and case control statements. The set and shift commands and handling positional parameters. The here ( << ) document and trap command. Simple shell program examples. File inodes and the inode structure. File links – hard and soft links. Filters. Head and tail commands. Cut and paste commands. The sort command and its usage with different options. The umask and default file permissions. Two special files /dev/null and /dev/tty.  "
          },
          {
            "m": "Module 5",
            "mdesc": "Meaning of a process. Mechanism of process creation. Parent and child process. The ps command with its options. Executing a command at a specified point of time: at command. Executing a command periodically: cron command and the crontab file.. Signals. The nice and nohup commands. Background processes. The bg and fg command. The kill command. The find command with illustrative example. \n\n  Structure of a perl script. Running a perl script. Variables and operators. String handling functions. Default variables - $_ and $. – representing the current line and current line number. The range operator. Chop() and chomp() functions. Lists and arrays. The @- variable. The splice operator, push(), pop(), split() and join(). File handles and handling file – using open(), close() and die () functions.. Associative arrays – keys and value functions. Overview of decision making loop control structures – the foreach. Regular expressions – simple and multiple search patterns. The match and substitute operators.  Defining and using subroutines."
          }
        ],
        "descname": "Prescribed Text books",
        "descdata": "Text Books:\n1. B. S. Grewal, Higher Engineering Mathematics, Khanna publishers, 42nd edition, 2013.\n2. B.V. Ramana Higher Engineering Mathematics Tata McGraw-Hill,2006.\n\nReference Books:\n1. N. P. Bali and Manish Goyal, A text book of Engineering mathematics , Laxmi publications, latestedition.\n2. Kreyszig, Advanced Engineering Mathematics  - 9th edition, Wiley.\n3. H. K Dass and Er. Rajnish Verma ,Higher Engineering Mathematics, S. Chand, 1st ed.",
        "notesurl": "https://adityam945.github.io/cse-json-files/",
        "notesscreenname": "NotesListFile",
        "notesscreenparams": "17mat31notes.json",
        "qpscreentype": "QPaperListFile",
        "qpurl": "https://adityam945.github.io/cse-json-files/",
        "qpscreenparams": "17mat31qp.json",
        "qbscreentype": "QBankListFile",
        "qburl": "https://adityam945.github.io/cse-json-files/",
        "qbscreenparams": "17mat31qb.json"
      }
    ],
    "subj6data": [
      {
        "_id": "5ed6619726a0e62580ac6dc8",
        "subcode": "17CS36",
        "subname": "DISCRETE MATHEMATICAL STRUCTURES",
        "moduledesc": [
          {
            "m": "Module 1",
            "mdesc": "Fundamentals of Logic: \n Basic Connectives and Truth Tables, Logic Equivalence – The Laws of Logic, Logical Implication – Rules of Inference.\n\n Fundamentals of Logic contd.: \nThe Use of Quantifiers, Quantifiers, Definitions and the Proofs of Theorems"
          },
          {
            "m": "Module 2",
            "mdesc": "Properties of the Integers: \n Mathematical Induction, The Well Ordering Principle – Mathematical Induction, Recursive Definitions. Principles of Counting.\n\n Fundamental Principles of Counting:\n The Rules of Sum and Product, Permutations, Combinations – The Binomial Theorem, Combinations with Repetition"
          },
          {
            "m": "Module 3",
            "mdesc": "Relations and Functions:\n Cartesian Products and Relations, Functions – Plain and One-to-One, Onto Functions. The Pigeon-hole Principle, Function Composition and Inverse Functions. Properties of Relations, Computer Recognition – Zero-One Matrices and Directed Graphs, Partial Orders  – Hasse Diagrams, Equivalence Relations and Partitions."
          },
          {
            "m": "Module 4",
            "mdesc": "The Principle of Inclusion and Exclusion:\n The Principle of Inclusion and Exclusion, Generalizations of the Principle, Derangements – Nothing is in its Right Place, Rook Polynomials. \n\nRecurrence Relations: \nFirst Order Linear Recurrence Relation, The Second Order Linear Homogeneous Recurrence Relation with Constant Coefficients"
          },
          {
            "m": "Module 5",
            "mdesc": " Introduction to Graph Theory:\n Definitions and Examples, Sub graphs, Complements, and Graph Isomorphism, Vertex Degree, Euler Trails and Circuits .\n\n Trees:\n Definitions, Properties, and Examples, Routed Trees, Trees and Sorting, Weighted Trees and Prefix Codes "
          }
        ],
        "descname": "Prescribed Text books",
        "descdata": "Text Books:\n1. B. S. Grewal, Higher Engineering Mathematics, Khanna publishers, 42nd edition, 2013.\n2. B.V. Ramana Higher Engineering Mathematics Tata McGraw-Hill,2006.\n\nReference Books:\n1. N. P. Bali and Manish Goyal, A text book of Engineering mathematics , Laxmi publications, latestedition.\n2. Kreyszig, Advanced Engineering Mathematics  - 9th edition, Wiley.\n3. H. K Dass and Er. Rajnish Verma ,Higher Engineering Mathematics, S. Chand, 1st ed.",
        "notesurl": "https://adityam945.github.io/cse-json-files/",
        "notesscreenname": "NotesListFile",
        "notesscreenparams": "17mat31notes.json",
        "qpscreentype": "QPaperListFile",
        "qpurl": "https://adityam945.github.io/cse-json-files/",
        "qpscreenparams": "17mat31qp.json",
        "qbscreentype": "QBankListFile",
        "qburl": "https://adityam945.github.io/cse-json-files/",
        "qbscreenparams": "17mat31qb.json"
      }
    ]
  }
]
