[
  {
    "_id": "5ed917147b48e806e49e2ebb",
    "subcode": "17CS51",
    "subname": "MANAGEMENT AND ENTREPRENEURSHIP FOR IT INDUSTRY ",
    "m1": "Module 1",
    "m1desc": "Introduction - \n Meaning, nature and characteristics of management, scope and Functional areas of management, goals of management, levels of management, brief overview of evolution of management theories,. Planning- Nature, importance, types of plans, steps in planning, Organizing- nature and purpose, types of Organization, Staffing- meaning, process of recruitment and selection  ",
    "m2": "Module 2",
    "m2desc": "Directing and controlling- \n meaning and nature of directing, leadership styles, motivation Theories, Communication- Meaning and importance, Coordination- meaning and importance, Controlling- meaning, steps in controlling, methods of establishing control.     ",
    "m3": "Module 3",
    "m3desc": "Entrepreneur –\n  meaning of entrepreneur, characteristics of entrepreneurs, classification and types of entrepreneurs, various stages in entrepreneurial process, role of entrepreneurs in economic development, entrepreneurship in India and barriers to entrepreneurship. Identification of business opportunities, market feasibility study, technical feasibility study, financial feasibility study and social feasibility study",
    "m4": "Module 4",
    "m4desc": "Preparation of project and ERP -\n  meaning of project, project identification, project selection, project report, need and significance of project report, contents, formulation, guidelines by planning commission for project report, \n\nEnterprise Resource Planning:\n Meaning and Importance- ERP and Functional areas of Management – Marketing / Sales- Supply Chain Management – Finance and  Accounting – Human Resources – Types of reports and methods of report generation     ",
    "m5": "Module 5",
    "m5desc": " Micro and Small Enterprises:\n Definition of micro and small enterprises, characteristics and advantages of micro and small enterprises, steps in establishing micro and small enterprises, Government of India indusial policy 2007 on micro and small enterprises, case study (Microsoft), Case study(Captain G R Gopinath),case study (N R Narayana Murthy & Infosys),  \n\nInstitutional support:\n MSME-DI, NSIC, SIDBI, KIADB, KSSIDC, TECSOK, KSFC, DIC and District level single window agency, Introduction to IPR. ",
    "descname": "Prescribed text books",
    "descdata": "Text  Books:\n 1. Principles of Management -P. C. Tripathi, P. N. Reddy; Tata McGraw Hill, 4th / 6th Edition, 2010.\n 2. Dynamics of Entrepreneurial Development & Management -Vasant Desai Himalaya Publishing House.\n  3. Entrepreneurship Development -Small Business Enterprises -Poornima M Charantimath Pearson Education – 2006.\n  4. Management and Entrepreneurship - Kanishka Bedi- Oxford University Press-2017 \n\nReference Books:\n 1. Management Fundamentals -Concepts, Application, Skill Development Robert Lusier – Thomson. \n 2. Entrepreneurship Development -S S Khanka -S Chand & Co.\n  3. Management -Stephen Robbins -Pearson Education /PHI -17th Edition, 2003     ",
    "__v": 0
  },
  {
    "_id": "5ed9172d7b48e806e49e2ebc",
    "subcode": "17CS52",
    "subname": "COMPUTER NETWORKS ",
    "m1": "Module 1",
    "m1desc": " Application Layer: \n Principles of Network Applications: Network Application Architectures, Processes Communicating, Transport Services Available to Applications, Transport Services Provided by the Internet, Application-Layer Protocols. The Web and HTTP: Overview of HTTP, Non-persistent and Persistent Connections, HTTP Message Format, User-Server Interaction: Cookies, Web Caching, The Conditional GET, File Transfer: FTP Commands & Replies, Electronic Mail in the Internet: SMTP, Comparison with HTTP, Mail Message Format, Mail Access Protocols, DNS; The Internet's Directory Service: Services Provided by DNS, Overview of How DNS Works, DNS Records and Messages, Peer-to-Peer Applications: P2P File Distribution, Distributed Hash Tables. ",
    "m2": "Module 2",
    "m2desc": "  Transport Layer :\n Introduction and Transport-Layer Services: Relationship Between Transport and Network Layers, Overview of the Transport Layer in the Internet, Multiplexing and Demultiplexing: Connectionless Transport: UDP,UDP Segment Structure, UDP Checksum, Principles of Reliable Data Transfer: Building a Reliable Data Transfer Protocol, Pipelined Reliable Data Transfer Protocols, Go-Back-N, Selective repeat, Connection-Oriented Transport TCP: The TCP Connection, TCP Segment Structure, Round-Trip Time Estimation and Timeout, Reliable Data Transfer, Flow Control, TCP Connection Management, Principles of Congestion Control: The Causes and the Costs of Congestion, Approaches to Congestion Control.  ",
    "m3": "Module 3",
    "m3desc": "The Network layer: \n What's Inside a Router?: Input Processing, Switching, Output Processing, Where Does Queuing Occur? Routing control plane, IPv6,A Brief foray into IP Security, Routing Algorithms: The Link-State (LS) Routing Algorithm, The Distance-Vector (DV) Routing Algorithm,  Hierarchical Routing, Routing in the Internet, Intra-AS Routing in the Internet: RIP, Intra-AS Routing in the Internet: OSPF, Inter/AS Routing: BGP, Broadcast Routing Algorithms and Multicast. ",
    "m4": "Module 4",
    "m4desc": "Wireless and Mobile Networks: \n Cellular Internet Access: An Overview of Cellular Network Architecture, 3G Cellular Data Networks: Extending the Internet to Cellular subscribers, On to 4G:LTE,Mobility management: Principles, Addressing, Routing to a mobile node, Mobile IP, Managing mobility in cellular Networks, Routing calls to a Mobile user, Handoffs in GSM, Wireless and Mobility: Impact on Higher-layer protocols  ",
    "m5": "Module 5",
    "m5desc": "Multimedia Networking: \nProperties of video, properties of Audio, Types of multimedia Network Applications, Streaming  stored video: UDP Streaming, HTTP Streaming, Adaptive streaming and DASH, content distribution Networks, case study: You Tube.\n\n Network Support for Multimedia: \nQuality-of-Service (QoS) Guarantees: Resource Reservation and Call Admission ",
    "descname": "Prescribed text books",
    "descdata": "Text  Books:\n 1. James F Kurose and Keith W Ross, Computer Networking, A Top-Down Approach, Sixth edition, Pearson,2017 . \n\nReference Books:\n 1. Behrouz A Forouzan, Data and Communications and Networking, Fifth Edition, McGraw Hill, Indian Edition\n 2. Larry L Peterson and Brusce S Davie, Computer Networks, fifth edition, ELSEVIER \n3. Andrew S Tanenbaum, Computer Networks, fifth edition, Pearson\n 4. Mayank Dave, Computer Networks, Second edition, Cengage Learning    ",
    "__v": 0
  },
  {
    "_id": "5ed9173c7b48e806e49e2ebd",
    "subcode": "17CS53",
    "subname": "DATABASE MANAGEMENT SYSTEM  ",
    "m1": "Module 1",
    "m1desc": " Introduction to Databases: \n Introduction, Characteristics of database approach, Advantages of using the DBMS approach, History of database applications. \n\nOverview of Database Languages and Architectures:\n Data Models, Schemas, and Instances. Three schema architecture and data independence, database languages, and interfaces, The Database System environment. \n\nConceptual Data Modelling using Entities and Relationships: \n Entity types, Entity sets, attributes, roles, and structural constraints, Weak entity types, ER diagrams, examples, Specialization and Generalization.    ",
    "m2": "Module 2",
    "m2desc": " Relational Model: \nRelational Model Concepts, Relational Model Constraints and relational database schemas, Update operations, transactions, and dealing with constraint violations.\n\n Relational Algebra:\n Unary and Binary relational operations, additional relational operations (aggregate, grouping, etc.) Examples of Queries in relational algebra.\n\n Mapping Conceptual Design into a Logical Design: \n Relational Database Design using ER-to-Relational mapping. \n\n SQL:\n SQL data definition and data types, specifying constraints in SQL, retrieval queries in SQL, INSERT, DELETE, and UPDATE statements in SQL, Additional features of SQL    ",
    "m3": "Module 3",
    "m3desc": "SQL : \n Advances Queries: More complex SQL retrieval queries, Specifying constraints as assertions and action triggers, Views in SQL, Schema change statements in SQL. \n\nDatabase Application Development:\n Accessing databases from applications, An introduction to JDBC, JDBC classes and interfaces, SQLJ, Stored procedures, Case study: The internet Bookshop. \n\n Internet Applications:\n The three-Tier application architecture, The presentation layer, The Middle Tier     ",
    "m4": "Module 4",
    "m4desc": "Normalization: \n Database Design Theory – Introduction to Normalization using Functional and Multivalued Dependencies: Informal design guidelines for relation schema, Functional Dependencies, Normal Forms based on Primary Keys, Second and Third Normal Forms, Boyce-Codd Normal Form, Multivalued Dependency and Fourth Normal Form, Join Dependencies and Fifth Normal Form. \n\n Normalization Algorithms:\n Inference Rules, Equivalence, and Minimal Cover, Properties of Relational Decompositions, Algorithms for Relational Database Schema Design, Nulls, Dangling tuples, and alternate Relational Designs, Further discussion of Multivalued dependencies and 4NF, Other dependencies and Normal Forms      ",
    "m5": "Module 5",
    "m5desc": " Transaction Processing:\n Introduction to Transaction Processing, Transaction and System concepts, Desirable properties of Transactions, Characterizing schedules based on recoverability, Characterizing schedules based on Serializability, Transaction support in SQL. \n\n Concurrency Control in Databases: \nTwo-phase locking techniques for Concurrency control, Concurrency control based on Timestamp ordering, Multiversion Concurrency control techniques, Validation Concurrency control techniques, Granularity of Data items and Multiple Granularity Locking.\n\n Introduction to Database Recovery Protocols:\n Recovery Concepts, NO-UNDO/REDO recovery based on Deferred update, Recovery techniques based on immediate update, Shadow paging, Database backup and recovery from catastrophic failures      ",
    "descname": "Prescribed text books",
    "descdata": " Text  Books: \n1. Fundamentals of Database Systems, Ramez Elmasri and Shamkant B. Navathe, 7th Edition, 2017, Pearson. \n 2. Database management systems, Ramakrishnan, and Gehrke, 3rd Edition, 2014, McGraw Hill \n\n Reference Books: \n1. Silberschatz Korth and Sudharshan, Database System Concepts, 6th Edition, McGrawHill, 2013.\n 2. Coronel, Morris, and Rob, Database Principles Fundamentals of Design, Implementation and Management, Cengage Learning 2012.      ",
    "__v": 0
  },
  {
    "_id": "5ed917517b48e806e49e2ebe",
    "subcode": "17CS54",
    "subname": "AUTOMATA THEORY AND COMPUTABILITY   ",
    "m1": "Module 1",
    "m1desc": " Teaching Hours Why study the Theory of Computation, Languages and Strings: \nStrings, Languages. A Language Hierarchy, Computation, \n\nFinite State Machines (FSM): \n Deterministic FSM, Regular languages, Designing FSM, Nondeterministic FSMs, From FSMs to Operational Systems, Simulators for FSMs, Minimizing FSMs, Canonical form of Regular languages, Finite State Transducers, Bidirectional Transducers.    ",
    "m2": "Module 2",
    "m2desc": " Regular Expressions (RE): \n what is a RE?, Kleene’s theorem, Applications of REs, Manipulating and Simplifying REs.  Regular Grammars: Definition, Regular Grammars and Regular languages.  Regular Languages (RL) and Nonregular Languages: How many RLs, To show that a language is regular, Closure properties of RLs, to show some languages are not RLs.             ",
    "m3": "Module 3",
    "m3desc": "   Context-Free Grammars(CFG):\n Introduction to Rewrite Systems and Grammars, CFGs and languages, designing CFGs, simplifying CFGs, proving that a Grammar is correct, Derivation and Parse trees, Ambiguity, Normal Forms. Pushdown Automata (PDA):  Definition of non-deterministic PDA, Deterministic and Non-deterministic PDAs, Non-determinism and Halting, alternative equivalent definitions of a PDA, alternatives that are not equivalent to PDA. ",
    "m4": "Module 4",
    "m4desc": "Context-Free and Non-Context-Free Languages:\n Where do the Context-Free Languages(CFL) fit, Showing a language is context-free, Pumping theorem for CFL, Important closure properties of CFLs, Deterministic CFLs. Algorithms and Decision Procedures for CFLs: Decidable questions, Un-decidable questions. Turing Machine: Turing machine model, Representation, Language acceptability by TM, design of TM, Techniques  for TM construction. ",
    "m5": "Module 5",
    "m5desc": " Variants of Turing Machines (TM), The model of Linear Bounded automata: \nDecidability: Definition of an algorithm, decidability, decidable languages, Undecidable languages, halting problem of TM, Post correspondence problem. Complexity: Growth rate of functions, the classes of P and NP, Quantum Computation: quantum computers, Church-Turing thesis.  ",
    "descname": "Prescribed text books",
    "descdata": " Text  Books: \n1. Elaine Rich,  Automata, Computability and Complexity, 1st  Edition, Pearson Education,2012/2013 \n2. K L P Mishra, N Chandrasekaran , 3rd Edition, Theory of Computer Science, PhI, 2012. \n\nReference Books:\n 1. John E Hopcroft, Rajeev Motwani, Jeffery D Ullman, Introduction to AutomataTheory,  Languages, and Computation, 3rd Edition, Pearson Education, 2013 \n2. Michael Sipser : Introduction to the Theory of Computation, 3rd edition, Cengage learning,2013\n 3. John C Martin, Introduction to Languages and The Theory of Computation,  3rd Edition,  Tata McGraw –Hill Publishing Company Limited, 2013 \n 4. Peter Linz, “An Introduction to Formal Languages and Automata”, 3rd Edition, Narosa  Publishers, 1998 \n 5. Basavaraj S. Anami, Karibasappa K G,  Formal Languages and Automata theory, Wiley India, 2012 \n 6. C K Nagpal, Formal Languages and Automata Theory, Oxford University press, 2012.  ",
    "__v": 0
  },
  {
    "_id": "5ed9175d7b48e806e49e2ebf",
    "subcode": "17CS551",
    "subname": "OBJECT ORIENTED MODELING AND DESIGN   ",
    "m1": "Module 1",
    "m1desc": " Introduction, Modelling Concepts and Class Modelling:\n What is Object orientation? What is OO development? OO Themes; Evidence for usefulness of OO development; OO modelling history. Modelling as Design technique: Modelling; abstraction; The Three models. Class Modelling: Object and Class  Concept; Link and associations concepts; Generalization and Inheritance; A sample class model; Navigation of class models; Advanced Class Modelling, Advanced object and class concepts; Association ends; N-ary associations; Aggregation; Abstract classes; Multiple inheritance; Metadata; Reification; Constraints; Derived  Data; Packages.  ",
    "m2": "Module 2",
    "m2desc": "UseCase Modelling and Detailed Requirements:\n Overview; Detailed objectoriented Requirements definitions; System Processes-A use case/Scenario view; Identifying Input and outputs-The System sequence diagram; Identifying Object Behaviour-The state chart Diagram; Integrated Object-oriented Models. ",
    "m3": "Module 3",
    "m3desc": " Process Overview, System Conception and Domain Analysis: \nProcess Overview: Development stages; Development life Cycle; System Conception: Devising a system concept; elaborating a concept; preparing a problem statement. Domain Analysis: Overview of analysis; Domain Class model: Domain state model; Domain interaction model; Iterating the analysis.",
    "m4": "Module 4",
    "m4desc": "Use case Realization :\nThe Design Discipline within up iterations: Object Oriented Design-The Bridge between Requirements and Implementation; Design Classes and Design within Class Diagrams; Interaction Diagrams-Realizing Use Case and defining methods; Designing with Communication Diagrams; Updating the Design Class Diagram; Package  Diagrams-Structuring the Major Components; Implementation Issues for Three-Layer Design. ",
    "m5": "Module 5",
    "m5desc": " Design Patterns:\n Introduction; what is a design pattern?, Describing  design patterns, the catalogue of design patterns, Organizing the  catalogue, How  design patterns solve design problems, how to select a design patterns, how to use a design pattern; Creational patterns: prototype and singleton (only); structural patterns adaptor and proxy (only). ",
    "descname": "Prescribed text books",
    "descdata": " Text  Books: \n1. Michael Blaha, James  Rumbaugh: Object Oriented Modelling and Design with UML,2nd Edition, Pearson Education,2005\n 2. Satzinger, Jackson and Burd: Object-Oriented Analysis & Design with the Unified Process, Cengage Learning, 2005.\n 3. Erich Gamma, Richard Helm, Ralph Johnson and john Vlissides: Design Patterns – Elements of Reusable Object-Oriented Software,  Pearson Education,2007.\n\n Reference Books:\n 1. Grady Booch et. al.: Object-Oriented Analysis and Design with Applications,3rd Edition,Pearson Education,2007. \n2. 2.Frank Buschmann, RegineMeunier, Hans Rohnert, Peter Sommerlad, Michel Stal: Pattern –Oriented Software Architecture. A system of patterns , Volume 1, John Wiley and Sons.2007.  ",
    "__v": 0
  },
  {
    "_id": "5ed917887b48e806e49e2ec0",
    "subcode": "17CS552",
    "subname": "INTRODUCTION TO SOFTWARE TESTING   ",
    "m1": "Module 1",
    "m1desc": "Basics of Software Testing:\n Basic definitions, Software Quality , Requirements, Behaviour and Correctness, Correctness versus Reliability, Testing and Debugging, Test cases, Insights from a Venn diagram, Identifying test cases, Test-generation Strategies, Test Metrics, Error and fault taxonomies , Levels of testing, Testing and Verification, Static Testing. ",
    "m2": "Module 2",
    "m2desc": "Problem Statements: \nGeneralized pseudo code, the triangle problem, the NextDate function, the commission problem, the SATM (Simple Automatic Teller Machine) problem, the currency converter, Saturn windshield wiper\n\n Functional Testing:\n Boundary value analysis, Robustness testing, Worst-case testing, Robust Worst testing for triangle problem, NextDate problem and commission problem, Equivalence classes, Equivalence test cases for the triangle problem, NextDate function, and the commission problem, Guidelines and observations, Decision tables, Test cases for the triangle problem, NextDate function, and the commission problem, Guidelines and observations.",
    "m3": "Module 3",
    "m3desc": "Fault Based Testing:\n Overview, Assumptions in fault based testing, Mutation analysis, Fault-based adequacy criteria, Variations on mutation analysis. \n\nStructural Testing:\n Overview, Statement testing, Branch testing, Condition testing, \n\nPath testing:\n DD paths, Test coverage metrics, Basis path testing, guidelines and observations, Data –Flow testing: Definition-Use testing, Slicebased testing, Guidelines and observations.  ",
    "m4": "Module 4",
    "m4desc": "Test Execution: \nOverview of test execution, from test case specification to test cases, Scaffolding, Generic versus specific scaffolding, Test oracles, Self-checks as oracles, Capture and replay \n\nProcess Framework :\nBasic principles: Sensitivity, redundancy, restriction, partition, visibility, Feedback, the quality process, Planning and monitoring, Quality goals, Dependability properties ,Analysis Testing, Improving the process, Organizational factors.  \n\n Planning and Monitoring the Process: \nQuality and process, Test and analysis strategies and plans, Risk planning, monitoring the process, Improving the process, the quality team. ",
    "m5": "Module 5",
    "m5desc": "Integration and Component-\nBased Software Testing: Overview, Integration testing strategies, Testing components and assemblies. System, Acceptance and Regression Testing: Overview, System testing, Acceptance testing, Usability, Regression testing, Regression test selection techniques, Test case prioritization and selective execution. Levels of Testing,\n\n Integration Testing:\n  Traditional view of testing levels, Alternative life-cycle models, The SATM system, Separating integration and system testing, A closer look at the SATM system, Decomposition-based, call graph-based, Path-based integrations.  ",
    "descname": "Prescribed text books",
    "descdata": " Text  Books:\n 1. Paul C. Jorgensen: Software Testing, A Craftsman’s Approach, 3rd Edition, Auerbach Publications, 2008. \n 2. Mauro Pezze, Michal Young: Software Testing and Analysis – Process, Principles and Techniques, Wiley India, 2009.\n 3. Aditya P Mathur: Foundations of Software Testing, Pearson Education, 2008.\n\n Reference Books: \n 1. Software testing Principles and Practices – Gopalaswamy Ramesh,  Srinivasan Desikan, 2 nd Edition, Pearson, 2007. \n 2.  Software Testing – Ron Patton, 2nd edition, Pearson Education, 2004. \n 3.  The Craft of Software Testing – Brian Marrick, Pearson Education, 1995. \n 4. Anirban Basu, Software Quality Assurance, Testing and Metrics, PHI, 2015 \n 5. Naresh Chauhan, Software Testing, Oxford University press.  ",
    "__v": 0
  },
  {
    "_id": "5ed917967b48e806e49e2ec1",
    "subcode": "17CS553",
    "subname": "ADVANCED JAVA AND J2EE    ",
    "m1": "Module 1",
    "m1desc": "Enumerations, Autoboxing and Annotations(metadata): \n Enumerations, Enumeration fundamentals, the values() and valueOf() Methods, java enumerations are class types, enumerations Inherits Enum, example, type wrappers, Autoboxing, Autoboxing and Methods, Autoboxing/Unboxing occurs in Expressions, Autoboxing/Unboxing, Boolean and character values, Autoboxing/Unboxing helps prevent errors,  A word of Warning. Annotations, Annotation basics, specifying retention policy, Obtaining Annotations at run time by use of reflection, Annotated element Interface, Using Default values,  Marker Annotations, Single Member annotations, Built-In annotations ",
    "m2": "Module 2",
    "m2desc": "The collections and Framework: \n Collections Overview, Recent Changes to Collections, The Collection Interfaces, The Collection Classes, Accessing a collection Via an Iterator, Storing User Defined Classes in Collections, The Random Access Interface, Working With Maps, Comparators, The Collection Algorithms, Why Generic Collections?, The legacy Classes and Interfaces, Parting Thoughts on Collections. ",
    "m3": "Module 3",
    "m3desc": "String Handling :\nThe String Constructors, String Length, Special String Operations, String Literals, String Concatenation, String Concatenation with Other Data Types, String Conversion and toString( ) Character Extraction, charAt( ), getChars( ), getBytes( ) toCharArray(), String Comparison, equals( ) and equalsIgnoreCase( ), regionMatches( ) startsWith( ) and endsWith( ), equals( ) Versus == , compareTo( ) Searching Strings, Modifying a String, substring( ), concat( ), replace( ), trim( ), Data Conversion Using valueOf( ), Changing the Case of Characters Within a String, Additional String Methods, StringBuffer , StringBuffer Constructors, length( ) and capacity( ), ensureCapacity( ), setLength( ), charAt( ) and setCharAt( ), getChars( ),append( ), insert( ), reverse( ), delete( ) and deleteCharAt( ), replace( ),  substring( ),  Additional StringBuffer Methods, StringBuilder",
    "m4": "Module 4",
    "m4desc": "Background; \n The Life Cycle of a Servlet; Using Tomcat for Servlet Development;  A simple Servlet; The Servlet API; The Javax.servlet Package;  Reading Servlet Parameter; The Javax.servlet.http package;  Handling HTTP Requests and Responses; Using Cookies; Session Tracking. Java Server Pages (JSP): JSP, JSP Tags, Tomcat, Request String, User Sessions, Cookies, Session Objects ",
    "m5": "Module 5",
    "m5desc": "The Concept of JDBC; JDBC Driver Types;\n  JDBC Packages; A Brief Overview of the JDBC process;  Database Connection; Associating the JDBC/ODBC Bridge with the Database; Statement Objects; ResultSet; Transaction Processing; Metadata, Data types; Exceptions. ",
    "descname": "Prescribed text books",
    "descdata": " Text  Books: \n1. Herbert Schildt: JAVA the Complete Reference, 7th/9th Edition, Tata McGraw Hill, 2007.\n 2. Jim Keogh: J2EE-TheCompleteReference, McGraw Hill, 2007. \n\nReference Books:\n 1. Y. Daniel Liang:  Introduction to JAVA Programming, 7thEdition, Pearson Education, 2007. \n2. Stephanie Bodoff et al: The J2EE Tutorial, 2nd Edition, Pearson Education,2004.\n 3. Uttam K Roy, Advanced JAVA programming, Oxford University press, 2015.   ",
    "__v": 0
  },
  {
    "_id": "5ed917a87b48e806e49e2ec2",
    "subcode": "17CS554",
    "subname": "ADVANCED ALGORITHMS   ",
    "m1": "Module 1",
    "m1desc": "Analysis Techniques:\n Growth functions, Recurrences and solution of recurrence equations; Amortized analysis: Aggregate, Accounting, and Potential methods, String Matching Algorithms: Naive Algorithm; Robin-Karp Algorithm, String matching with Finite Automata, Knuth-Morris-Pratt and Boyer-Moore Algorithms ",
    "m2": "Module 2",
    "m2desc": "Number Theoretic Algorithms: \nElementary notions, GCD, Modular arithmetic, Solving modular linear equations, The Chinese remainder theorem, Powers of an element RSA Cryptosystem, Primality testing, Integer factorization, - Huffman Codes, Polynomials. FFT-Huffman codes: Concepts, construction, Proof correctness of Huffman's algorithm; Representation of polynomil ",
    "m3": "Module 3",
    "m3desc": "DFT and FFT efficient implementation of FFT, Graph Algorithms, Bellman-Ford Algorithm Shortest paths in a DAG, Johnson's Algorithm for sparse graphs, Flow networks and the Ford-Fulkerson Algorithm, Maximum bipartite matching. ",
    "m4": "Module 4",
    "m4desc": "Computational Geometry-I:\n Geometric data structures using, C,   Vectors, Points, Polygons, Edges Geometric objects in space; Finding the intersection of a line and a triangle, Finding star-shaped polygons using incremental insertion. ",
    "m5": "Module 5",
    "m5desc": "Computational Geometry-II:\n Clipping: Cyrus-Beck and Sutherland-Hodman Algorithms; Triangulating, monotonic polygons; Convex hulls, Gift wrapping and Graham Scan; Removing hidden surfaces ",
    "descname": "Prescribed text books",
    "descdata": " Text  Books:\n 1. Thomas H. Cormen et al: Introduction to Algorithms, Prentice Hall India, 1990 \n2. Michael J. Laszlo: Computational Geometry and Computer Graphics in C' Prentice Hall India, 1996  \n\nReference Books:\n 1. E. Horowitz, S. Sahni and S. Rajasekaran, Fundamentals of Computer Algorithms, University Press,  Second edition, 2007\n 2. Kenneth  A Berman & Jerome L Paul, Algorithms, Cengage Learning, First Indian reprint, 2008  ",
    "__v": 0
  },
  {
    "_id": "5ed917b47b48e806e49e2ec3",
    "subcode": "17CS562",
    "subname": "ARTIFICIAL INTELLIGENCE",
    "m1": "Module 1",
    "m1desc": "What is artificial intelligence?, Problems, Problem Spaces and search, Heuristic search technique ",
    "m2": "Module 2",
    "m2desc": "Knowledge Representation Issues, Using Predicate Logic, Representing knowledge using Rules, ",
    "m3": "Module 3",
    "m3desc": "Symbolic Reasoning under Uncertainty, Statistical reasoning, Weak Slot and Filter Structures.  ",
    "m4": "Module 4",
    "m4desc": "Strong slot-and-filler structures, Game Playing",
    "m5": "Module 5",
    "m5desc": "Natural Language Processing, Learning, Expert Systems. ",
    "descname": "Prescribed text books",
    "descdata": "Text  Books:\n 1. E. Rich , K. Knight & S. B. Nair - Artificial Intelligence, 3/e, McGraw Hill.  \n\n Reference Books:\n 1. Artificial Intelligence: A Modern Approach, Stuart Rusell, Peter Norving, Pearson Education 2nd Edition. 1. Dan W. Patterson, Introduction to Artificial Intelligence and Expert Systems – Prentice Hal of India.\n 2. G. Luger, “Artificial Intelligence: Structures and Strategies for complex problem Solving”, Fourth Edition, Pearson Education, 2002.  ",
    "__v": 0
  },
  {
    "_id": "5ed917bf7b48e806e49e2ec4",
    "subcode": "17CS563",
    "subname": "EMBEDDED SYSTEMS ",
    "m1": "Module 1",
    "m1desc": "Introduction to embedded systems: \n Embedded systems, Processor embedded into a system, Embedded hardware units and device in a system, Embedded software in a system, Examples of embedded systems, Design process in embedded system, Formalization of system design, Design process and design examples, Classification of embedded systems, skills required for an embedded system designer.  ",
    "m2": "Module 2",
    "m2desc": "Devices and communication buses for devices network:\n IO types and example, Serial communication devices, Parallel device ports, Sophisticated interfacing features in device ports, Wireless devices, Timer and counting devices, Watchdog timer, Real time clock, Networked embedded systems, Serial bus communication protocols, Parallel bus device protocols-parallel communication internet using ISA, PCI,  PCI-X and advanced buses, Internet enabled systemsnetwork protocols, Wireless and mobile system protocols ",
    "m3": "Module 3",
    "m3desc": "Device drivers and interrupts and service mechanism: \n Programming-I/O busy-wait approach without interrupt service mechanism, ISR concept, Interrupt sources, Interrupt servicing (Handling) Mechanism, Multiple interrupts, Context and the periods for context switching, interrupt latency and deadline, Classification of processors interrupt service mechanism from Context-saving angle, Direct memory access, Device driver programming ",
    "m4": "Module 4",
    "m4desc": "Inter process communication and synchronization of processes, Threads and tasks: \n Multiple process in an application, Multiple threads in an application, Tasks, Task states, Task and Data, Clear-cut distinction between functions. ISRS and tasks by their characteristics, concept and semaphores, Shared data, Interprocess communication, Signal function, Semaphore functions, Message Queue functions, Mailbox functions, Pipe functions, Socket functions, RPC functions. ",
    "m5": "Module 5",
    "m5desc": "Real-time operating systems: \n OS Services, Process management, Timer functions, Event functions, Memory management, Device, file and IO subsystems management, Interrupt routines in RTOS environment and handling of interrupt source calls, Real-time operating systems, Basic design using an RTOS, RTOS task scheduling models, interrupt latency and response of the tasks as performance metrics, OS security issues. Introduction to embedded software development process and tools, Host and target machines, Linking and location software. ",
    "descname": "Prescribed text books",
    "descdata": "Text  Books:\n 1. Raj Kamal, “Embedded Systems: Architecture, Programming, and Design” 2nd / 3rd  edition , Tata McGraw hill-2013.\n\n  Reference Books:\n 1. Marilyn Wolf, “Computer as Components, Principles of Embedded Computing System Design” 3rd edition, Elsevier-2014.  ",
    "__v": 0
  },
  {
    "_id": "5ed917cb7b48e806e49e2ec5",
    "subcode": "17CS564",
    "subname": "DOT NET FRAMEWORK FOR APPLICATION DEVELOPMENT ",
    "m1": "Module 1",
    "m1desc": "Introducing Microsoft Visual C# and Microsoft Visual Studio 2015: Welcome to C#, Working with variables, operators and expressions, Writing methods and applying scope, Using decision statements, Using compound assignment and iteration statements, Managing errors and exceptions  ",
    "m2": "Module 2",
    "m2desc": "Understanding the C# object model: Creating and Managing classes and objects, Understanding values and references, Creating value types with enumerations and structures, Using arrays  ",
    "m3": "Module 3",
    "m3desc": "Understanding parameter arrays, Working with inheritance, Creating interfaces and defining abstract classes, Using garbage collection and resource management",
    "m4": "Module 4",
    "m4desc": "Defining Extensible Types with C#:\n Implementing properties to access fields, Using indexers, Introducing generics, Using collections",
    "m5": "Module 5",
    "m5desc": "Enumerating Collections, Decoupling application logic and handling events, Querying in-memory data by using query expressions, Operator overloading  ",
    "descname": "Prescribed text books",
    "descdata": "Text  Books:\n 1. John Sharp, Microsoft Visual C# Step by Step,  8th Edition, PHI Learning Pvt. Ltd. 2016 \n\n Reference Books:\n 1. Christian Nagel, “C# 6 and .NET Core 1.0”, 1st Edition, Wiley India Pvt Ltd, 2016. Andrew Stellman and Jennifer Greene, “Head First C#”, 3rd Edition, O’Reilly Publications, 2013.   \n2. Mark Michaelis, “Essential C# 6.0”, 5th Edition, Pearson Education India, 2016.\n  3. Andrew Troelsen, “Prof C# 5.0 and the .NET 4.5 Framework”, 6th Edition, Apress and Dreamtech Press, 2012.     ",
    "__v": 0
  }
]
