[
  {
    "_id": "5ed8e46d1f006923206b1f69",
    "subcode": "17CS71 ",
    "subname": "WEB TECHNOLOGY AND ITS APPLICATIONS ",
    "m1": "Module – 1",
    "m1desc": "Introduction to HTML, What is HTML and Where did it come from?, HTML Syntax, Semantic Markup, Structure of HTML Documents, Quick Tour of HTML Elements, HTML5 Semantic Structure Elements, Introduction to CSS, What is CSS, CSS Syntax, Location of Styles, Selectors, The Cascade: How Styles Interact, The Box Model, CSS Text Styling. ",
    "m2": "Module – 2",
    "m2desc": "HTML Tables and Forms, Introducing Tables, Styling Tables, Introducing Forms, Form Control Elements, Table and Form Accessibility, Microformats, Advanced CSS: Layout, Normal Flow, Positioning Elements, Floating Elements, Constructing Multicolumn Layouts, Approaches to CSS Layout, Responsive Design, CSS Frameworks. ",
    "m3": "Module – 3",
    "m3desc": "JavaScript: Client-Side Scripting, What is JavaScript and What can it do?, JavaScript Design Principles, Where does JavaScript Go?, Syntax, JavaScript Objects, The Document Object Model (DOM), JavaScript Events, Forms, Introduction to Server-Side Development with PHP, What is Server-Side Development, A Web Server’s Responsibilities, Quick Tour of PHP, Program Control, Functions ",
    "m4": "Module – 4",
    "m4desc": "PHP Arrays and Superglobals, Arrays, $_GET and $_POST Superglobal Arrays, $_SERVER Array, $_Files Array, Reading/Writing Files, PHP Classes and Objects, Object-Oriented Overview, Classes and Objects in PHP, Object Oriented Design, Error Handling and Validation, What are Errors and Exceptions?, PHP Error Reporting, PHP Error and Exception Handling ",
    "m5": "Module – 5",
    "m5desc": "Managing State, The Problem of State in Web Applications, Passing Information via Query Strings, Passing Information via the URL Path, Cookies, Serialization, Session State, HTML5 Web Storage, Caching, Advanced JavaScript and jQuery, JavaScript Pseudo-Classes, jQuery Foundations, AJAX, Asynchronous File Transmission, Animation, Backbone MVC Frameworks, XML Processing and Web Services, XML Processing, JSON, Overview of Web Services. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text Books:\n 1. Randy Connolly, Ricardo Hoar, 'Fundamentals of Web Development', 1stEdition, Pearson Education India.\n\nReference Books:\n 1) Robin Nixon, “Learning PHP, MySQL &JavaScript with jQuery, CSS and HTML5”, 4thEdition, O’Reilly Publications, 2015.\n 2) Luke Welling, Laura Thomson, “PHP and MySQL Web Development”, 5th Edition, Pearson Education, 2016.\n 3) Nicholas C Zakas, “Professional JavaScript for Web Developers”, 3rd Edition, Wrox/Wiley India, 2012.\n  4) David Sawyer Mcfarland, “JavaScript & jQuery: The Missing Manual”, 1st Edition, O’Reilly/Shroff Publishers & Distributors Pvt Ltd, 2014 (ISBN:9789351108078) 5) Zak Ruvalcaba Anne Boehm, “Murach's HTML5 and CSS3”, 3rdEdition, Murachs/Shroff Publishers & Distributors Pvt Ltd, 2016. ",
    "__v": 0
  },
  {
    "_id": "5ed8e53c1f006923206b1f6a",
    "subcode": "17CS72",
    "subname": "ADVANCED COMPUTER ARCHITECTURES",
    "m1": "Module – 1",
    "m1desc": "Theory of Parallelism: Parallel Computer Models, The State of Computing, Multiprocessors and Multicomputer ,Multivector and SIMD Computers ,PRAM and VLSI Models, Program and Network Properties ,Conditions of Parallelism, Program Partitioning and Scheduling, Program Flow Mechanisms, System Interconnect Architectures, Principles of Scalable Performance, Performance Metrics and Measures, Parallel Processing Applications, Speedup Performance Laws, Scalability Analysis and Approaches. ",
    "m2": "Module – 2",
    "m2desc": "Hardware Technologies: Processors and Memory Hierarchy, Advanced Processor Technology, Superscalar and Vector Processors, Memory Hierarchy Technology, Virtual Memory Technology. ",
    "m3": "Module – 3",
    "m3desc": "Bus, Cache, and Shared Memory ,Bus Systems ,Cache Memory Organizations ,Shared Memory Organizations ,Sequential and Weak Consistency Models ,Pipelining and Superscalar Techniques ,Linear Pipeline Processors ,Nonlinear Pipeline Processors ,Instruction Pipeline Design ,Arithmetic Pipeline Design ",
    "m4": "Module – 4",
    "m4desc": "Parallel and Scalable Architectures: Multiprocessors and Multicomputers ,Multiprocessor System Interconnects, Cache Coherence and Synchronization Mechanisms, Three Generations of Multicomputers ,Message-Passing Mechanisms ,Multivector and SIMD Computers ,Vector Processing Principles ,Multivector Multiprocessors ,Compound Vector Processing ,SIMD Computer Organizations (Upto 8.4),Scalable, Multithreaded, and Dataflow Architectures, Latency-Hiding Techniques, Principles of Multithreading, Fine-Grain Multicomputers, Scalable and Multithreaded Architectures, Dataflow and Hybrid Architectures.",
    "m5": "Module – 5",
    "m5desc": "Software for parallel programming: Parallel Models, Languages, and Compilers ,Parallel Programming Models, Parallel Languages and Compilers ,Dependence Analysis of Data Arrays ,Parallel Program Development and Environments, Synchronization and Multiprocessing Modes. Instruction and System Level Parallelism, Instruction Level Parallelism ,Computer Architecture ,Contents, Basic Design Issues ,Problem Definition ,Model of a Typical Processor ,Compiler-detected Instruction Level Parallelism ,Operand Forwarding ,Reorder Buffer, Register Renaming ,Tomasulo’s Algorithm ,Branch Prediction, Limitations in Exploiting Instruction Level Parallelism ,Thread Level Parallelism. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Kai Hwang and Naresh Jotwani, Advanced Computer Architecture (SIE): Parallelism, Scalability, Programmability, McGraw Hill Education 3/e. 2015\n\n Reference Books:\n 1. John L. Hennessy and David A. Patterson, Computer Architecture: A quantitative approach, 5th edition, Morgan Kaufmann Elseveir, 2013 ",
    "__v": 0
  },
  {
    "_id": "5ed8e5cf1f006923206b1f6b",
    "subcode": "17CS73 ",
    "subname": "MACHINE LEARNING ",
    "m1": "Module – 1",
    "m1desc": "Introduction:\n Well posed learning problems, Designing a Learning system, Perspective and Issues in Machine Learning. \n Concept Learning:\n Concept learning task, Concept learning as search, Find-S algorithm, Version space, Candidate Elimination algorithm, Inductive Bias",
    "m2": "Module – 2",
    "m2desc": "Decision Tree Learning:\n Decision tree representation, Appropriate problems for decision tree learning, Basic decision tree learning algorithm, hypothesis space search in decision tree learning, Inductive bias in decision tree learning, Issues in decision tree learning.",
    "m3": "Module – 3",
    "m3desc": "Artificial Neural Networks:\n Introduction, Neural Network representation, Appropriate problems, Perceptrons, Backpropagation algorithm. ",
    "m4": "Module – 4",
    "m4desc": "Bayesian Learning:\n Introduction, Bayes theorem, Bayes theorem and concept learning, ML and LS error hypothesis, ML for predicting probabilities, MDL principle, Naive Bayes classifier, Bayesian belief networks, EM algorithm ",
    "m5": "Module – 5",
    "m5desc": "Evaluating Hypothesis:\n Motivation, Estimating hypothesis accuracy, Basics of sampling theorem, General approach for deriving confidence intervals, Difference in error of two hypothesis, Comparing learning algorithms.\n Instance Based Learning:\n Introduction, k-nearest neighbor learning, locally weighted regression, radial basis function, cased-based reasoning,\n Reinforcement Learning:\n Introduction, Learning Task, Q Learning ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text Books:\n 1. Tom M. Mitchell, Machine Learning, India Edition 2013, McGraw Hill Education.\n\n Reference Books:\n 1. Trevor Hastie, Robert Tibshirani, Jerome Friedman, h The Elements of Statistical Learning, 2nd edition, springer series in statistics.\n 2. Ethem Alpaydın, Introduction to machine learning, second edition, MIT press. ",
    "__v": 0
  },
  {
    "_id": "5ed8ecf41f006923206b1f6c",
    "subcode": "17CS741",
    "subname": "NATURAL LANGUAGE PROCESSING",
    "m1": "Module – 1",
    "m1desc": "Overview and language modeling:\n Overview: Origins and challenges of NLPLanguage and Grammar-Processing Indian Languages- NLP ApplicationsInformation Retrieval. Language Modeling: Various Grammar- based Language Models-Statistical Language Model.",
    "m2": "Module – 2",
    "m2desc": "Word level and syntactic analysis:/n Word Level Analysis: Regular ExpressionsFinite-State Automata-Morphological Parsing-Spelling Error Detection and correction-Words and Word classes-Part-of Speech Tagging. Syntactic Analysis: Context-free Grammar-Constituency- Parsing-Probabilistic Parsing. ",
    "m3": "Module – 3",
    "m3desc": "Extracting Relations from Text: From Word Sequences to Dependency Paths:  \nIntroduction, Subsequence Kernels for Relation Extraction, A Dependency-Path Kernel for Relation Extraction and Experimental Evaluation. \nMining Diagnostic Text Reports by Learning to Annotate Knowledge Roles: \nIntroduction, Domain Knowledge and Knowledge Roles, Frame Semantics and Semantic Role Labeling, Learning to Annotate Cases with Knowledge Roles and Evaluations.\n A Case Study in Natural Language Based Web Search:\n InFact System Overview, The GlobalSecurity.org Experience. ",
    "m4": "Module – 4",
    "m4desc": "Evaluating Self-Explanations in iSTART:\n Word Matching, Latent Semantic Analysis, and Topic Models: Introduction, iSTART: \nFeedback Systems, iSTART: Evaluation of Feedback Systems\n Textual Signatures:\n Identifying Text-Types Using Latent Semantic Analysis to Measure the Cohesion of Text Structures:\n Introduction, Cohesion, CohMetrix, Approaches to Analyzing Texts, Latent Semantic Analysis, Predictions, Results of Experiments\nAutomatic Document Separation: A Combination of Probabilistic Classification and Finite-State Sequence Modeling: \nIntroduction, Related Work, Data Preparation, Document Separation as a Sequence Mapping Problem, Results. \nEvolving Explanatory Novel Patterns for Semantically-Based Text Mining: \nRelated Work, A Semantically Guided Model for Effective Text Mining.",
    "m5": "Module – 5",
    "m5desc": "INFORMATION RETRIEVAL AND LEXICAL RESOURCES: \nInformation Retrieval: Design features of Information Retrieval Systems-Classical, Non classical, Alternative Models of Information Retrieval – valuation Lexical Resources: World Net-Frame Net- Stemmers-POS Tagger- Research Corpora. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Tanveer Siddiqui, U.S. Tiwary, “Natural Language Processing and Information Retrieval”, Oxford University Press, 2008.\n 2. Anne Kao and Stephen R. Poteet (Eds), “Natural LanguageProcessing and Text  Mining”, Springer-Verlag London Limited 2007.\n\nReference Books:\n 1. Daniel Jurafsky and James H Martin, “Speech and Language Processing: Anintroduction to Natural Language Processing, Computational Linguistics and SpeechRecognition”, 2nd Edition, Prentice Hall, 2008.\n 2. James Allen, “Natural Language Understanding”, 2nd edition, Benjamin/Cummingspublishing company, 1995. \n3. Gerald J. Kowalski and Mark.T. Maybury, “Information Storage and Retrieval systems”, Kluwer academic Publishers, 2000.  ",
    "__v": 0
  },
  {
    "_id": "5ed8ed941f006923206b1f6d",
    "subcode": "17CS742 ",
    "subname": "CLOUD COMPUTING AND ITS APPLICATIONS",
    "m1": "Module – 1",
    "m1desc": "Introduction ,Cloud Computing at a Glance, The Vision of Cloud Computing, Defining a Cloud, A Closer Look, Cloud Computing Reference Model, Characteristics and Benefits, Challenges Ahead, Historical Developments, Distributed Systems, Virtualization, Web 2.0,  Service-Oriented Computing, Utility-Oriented Computing,  Building Cloud Computing Environments, Application Development,  Infrastructure and System Development,  Computing Platforms and Technologies, Amazon Web Services (AWS),  Google AppEngine, Microsoft Azure, Hadoop, Force.com and Salesforce.com, Manjrasoft Aneka.\nVirtualization, Introduction, Characteristics of Virtualized, Environments Taxonomy of Virtualization Techniques, Execution Virtualization, Other Types of Virtualization, Virtualization and Cloud Computing, Pros and Cons of Virtualization, Technology Examples Xen: Paravirtualization, VMware: Full Virtualization, Microsoft Hyper-V.",
    "m2": "Module – 2",
    "m2desc": "Cloud Computing Architecture, Introduction, Cloud Reference Model, Architecture, Infrastructure / Hardware as a Service, Platform as a Service, Software as a Service, Types of Clouds, Public Clouds, Private Clouds, Hybrid Clouds, Community Clouds, Economics of the Cloud, Open Challenges, Cloud Definition, Cloud Interoperability and Standards Scalability and Fault Tolerance Security, Trust, and Privacy Organizational Aspects .\nAneka: Cloud Application Platform, Framework Overview, Anatomy of the Aneka Container, From the Ground Up: Platform Abstraction Layer, Fabric Services, foundation Services, Application Services, Building Aneka Clouds, Infrastructure Organization, Logical Organization, Private Cloud Deployment Mode, Public Cloud Deployment Mode, Hybrid Cloud Deployment Mode, Cloud Programming and Management, Aneka SDK, Management Tools.",
    "m3": "Module – 3",
    "m3desc": "Concurrent Computing: Thread Programming, Introducing Parallelism for Single Machine Computation, Programming Applications with Threads, What is a Thread?, Thread APIs, Techniques for Parallel Computation with Threads, Multithreading with Aneka, Introducing the Thread Programming Model, Aneka Thread vs. Common Threads, Programming Applications with Aneka Threads, Aneka Threads Application Model, Domain Decomposition: Matrix Multiplication, Functional Decomposition: Sine, Cosine, and Tangent.\nHigh-Throughput Computing: Task Programming, Task Computing, Characterizing a Task, Computing Categories, Frameworks for Task Computing, Task-based Application Models, Embarrassingly Parallel Applications, Parameter Sweep Applications, MPI Applications, Workflow Applications with Task Dependencies, Aneka Task-Based Programming, Task Programming Model, Developing Applications with the Task Model, Developing Parameter Sweep Application, Managing Workflows. ",
    "m4": "Module – 4",
    "m4desc": "Data Intensive Computing: Map-Reduce Programming, What is Data-Intensive Computing?, Characterizing Data-Intensive Computations, Challenges Ahead, Historical Perspective, Technologies for Data-Intensive Computing, Storage Systems, Programming Platforms, Aneka MapReduce Programming, Introducing the MapReduce Programming Model, Example Application ",
    "m5": "Module – 5",
    "m5desc": "Cloud Platforms in Industry, Amazon Web Services, Compute Services, Storage Services, Communication Services, Additional Services, Google AppEngine, Architecture and Core Concepts, Application Life-Cycle, Cost Model, Observations, Microsoft Azure, Azure Core Concepts, SQL Azure, Windows Azure Platform Appliance. \nCloud Applications Scientific Applications, Healthcare: ECG Analysis in the Cloud, \nBiology: Protein Structure Prediction, Biology: Gene Expression Data Analysis for Cancer Diagnosis, \nGeoscience: Satellite Image Processing, Business and Consumer Applications, CRM and ERP, Productivity, Social Networking, Media Applications, Multiplayer Online Gaming. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Rajkumar Buyya, Christian Vecchiola, and Thamarai Selvi  Mastering Cloud. Computing McGraw Hill Education.\n\n Reference Books:\n 1. Dan C. Marinescu, Cloud Computing Theory and Practice, Morgan Kaufmann, Elsevier 2013. ",
    "__v": 0
  },
  {
    "_id": "5ed8ee0e1f006923206b1f6e",
    "subcode": "17CS743 ",
    "subname": "INFORMATION AND NETWORK SECURITY",
    "m1": "Module – 1",
    "m1desc": "Introduction. How to Speak Crypto. Classic Crypto. Simple Substitution Cipher. Cryptanalysis of a Simple Substitution. Definition of Secure. Double Transposition Cipher. One-time Pad. Project VENONA. Codebook Cipher. Ciphers of the Election of 1876. Modern Crypto History. Taxonomy of Cryptography. Taxonomy of Cryptanalysis. ",
    "m2": "Module – 2",
    "m2desc": "What is a Hash Function? The Birthday Problem.Non-cryptographic Hashes. Tiger Hash. HMAC. Uses of Hash Functions. Online Bids. Spam Reduction. Other Crypto-Related Topics. Secret Sharing. Key Escrow. Random Numbers. Texas Hold 'em Poker. Generating Random Bits. Information Hiding.",
    "m3": "Module – 3",
    "m3desc": "Random number generation Providing freshness Fundamentals of entity authentication Passwords Dynamic password schemes Zero-knowledge mechanisms Further reading Cryptographic Protocols Protocol basics From objectives to a protocol Analysing a simple protocol Authentication and key establishment protocols.",
    "m4": "Module – 4",
    "m4desc": "Key management fundamentals Key lengths and lifetimes Key generation Key establishment Key storage Key usage Governing key management Public-Key Management Certification of public keys The certificate lifecycle Public-key management models Alternative approaches.",
    "m5": "Module – 5",
    "m5desc": "Cryptographic Applications Cryptography on the Internet Cryptography for wireless local area networks Cryptography for mobile telecommunications Cryptography for secure payment card transactions Cryptography for video broadcasting Cryptography for identity cards Cryptography for home users.",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Information Security: Principles and Practice, 2nd Edition by Mark Stamp Wiley\n  2. Everyday Cryptography: Fundamental Principles and Applications Keith M. Martin Oxford Scholarship Online: December 2013.\n\nReference Books:\n 1. Applied Cryptography Protocols, Algorithms, and Source Code in C by Bruce Schneier  ",
    "__v": 0
  },
  {
    "_id": "5ed8eed51f006923206b1f6f",
    "subcode": "17CS744 ",
    "subname": "UNIX SYSTEM PROGRAMMING ",
    "m1": "Module – 1",
    "m1desc": "Introduction: UNIX and ANSI Standards: The ANSI C Standard, The ANSI/ISO C++ Standards, Difference between ANSI C and C++, The POSIX Standards, The POSIX.1 FIPS Standard, The X/Open Standards. UNIX and POSIX APIs: The POSIX APIs, The UNIX and POSIX Development Environment, API Common Characteristics.",
    "m2": "Module – 2",
    "m2desc": "UNIX Files and APIs: File Types, The UNIX and POSIX File System, The UNIX and POSIX File Attributes, Inodes in UNIX System V, Application Program Interface to Files, UNIX Kernel Support for Files, Relationship of C Stream Pointers and File Descriptors, Directory Files, Hard and Symbolic Links. UNIX File APIs: General File APIs, File and Record Locking, Directory File APIs, Device File APIs, FIFO File APIs, Symbolic Link File APIs.",
    "m3": "Module – 3",
    "m3desc": "UNIX Processes and Process Control: The Environment of a UNIX Process: Introduction, main function, Process Termination, Command-Line Arguments, Environment List, Memory Layout of a C Program, Shared Libraries, Memory Allocation, Environment Variables, setjmp and longjmp Functions, getrlimit, setrlimit Functions, UNIX Kernel Support for Processes. Process Control: Introduction, Process Identifiers, fork, vfork, exit, wait, waitpid, wait3, wait4 Functions, Race Conditions, exec Functions, Changing User IDs and Group IDs, Interpreter Files, system Function, Process Accounting, User Identification, Process Times, I/O Redirection. Process Relationships: Introduction, Terminal Logins, Network Logins, Process Groups, Sessions, Controlling Terminal, tcgetpgrp and tcsetpgrp Functions, Job Control, Shell Execution of Programs, Orphaned Process Groups. ",
    "m4": "Module – 4",
    "m4desc": "Signals and Daemon Processes: Signals: The UNIX Kernel Support for Signals, signal, Signal Mask, sigaction, The SIGCHLD Signal and the waitpid Function, The sigsetjmp and siglongjmp Functions, Kill, Alarm, Interval Timers, POSIX.lb Timers. Daemon Processes: Introduction, Daemon Characteristics, Coding Rules, Error Logging, Client-Server Model. ",
    "m5": "Module – 5",
    "m5desc": "Interprocess Communication : Overview of IPC Methods, Pipes, popen, pclose Functions, Coprocesses, FIFOs, System V IPC, Message Queues, Semaphores. Shared Memory, Client-Server Properties, Stream Pipes, Passing File Descriptors, An Open Server-Version 1, Client-Server Connection Functions.\n\nReference Books: 1. Advanced Unix Programming- Marc J. Rochkind, 2nd Edition, Pearson Education, 2005. 2. The Design of the UNIX Operating System - Maurice.J.Bach, Pearson Education /  PHI, 1987. 3. Unix Internals - Uresh Vahalia, Pearson Education, 2001. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Unix System Programming Using C++ - Terrence Chan, PHI, 1999.\n 2. Advanced Programming in the UNIX Environment - W.Richard Stevens, Stephen A. Rago, 3nd Edition, Pearson Education / PHI, 2005.\n\n Reference Books:\n 1. Advanced Unix Programming- Marc J. Rochkind, 2nd Edition, Pearson Education, 2005.\n 2. The Design of the UNIX Operating System - Maurice.J.Bach, Pearson Education /  PHI, 1987.\n 3. Unix Internals - Uresh Vahalia, Pearson Education, 2001. ",
    "__v": 0
  },
  {
    "_id": "5ed8ef511f006923206b1f70",
    "subcode": "17CS751 ",
    "subname": "SOFT AND EVOLUTIONARY COMPUTING  ",
    "m1": "Module – 1",
    "m1desc": "Introduction to soft computing: ANN, FS,GA, SI, ES, Comparing among intelligent systems.\n ANN: introduction, biological inspiration, BNN&ANN, classification, first Generation NN, perceptron, illustrative problems ",
    "m2": "Module – 2",
    "m2desc": "Adaline, Medaline, ANN:  (2nd generation), introduction, BPN, KNN,HNN, BAM, RBF,SVM and illustrative problems ",
    "m3": "Module – 3",
    "m3desc": "Fuzzy logic:\n introduction, human learning ability, undecidability, probability theory, classical set and fuzzy set, fuzzy set operations, fuzzy relations, fuzzy compositions, natural language and fuzzy interpretations, structure of fuzzy inference system, illustrative problems ",
    "m4": "Module – 4",
    "m4desc": "Introduction to GA, GA, procedures, working of GA, GA applications, applicability, evolutionary programming, working of EP, GA based Machine learning classifier system, illustrative problems",
    "m5": "Module – 5",
    "m5desc": "Swarm Intelligent system:\n Introduction, Background of SI, Ant colony system Working of ACO, Particle swarm Intelligence(PSO). ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Soft computing : N. P Padhy and S P Simon , Oxford University Press 2015.\n\n Reference Books:\n 1. Principles of Soft Computing, Shivanandam,  Deepa S. N  Wiley India,  2011. ",
    "__v": 0
  },
  {
    "_id": "5ed8f3111f006923206b1f72",
    "subcode": "17CS752 ",
    "subname": "COMPUTER VISION AND ROBOTICS",
    "m1": "Module – 1",
    "m1desc": "CAMERAS:\nPinhole Cameras,nRadiometry – Measuring Light: \nLight in Space, Light Surfaces, Important Special Cases, \nSources, Shadows, And Shading: \nQualitative Radiometry, Sources and Their Effects, Local Shading Models, Application: Photometric Stereo, Interreflections: Global Shading Models, \nColor: \nThe Physics of Color, Human Color Perception, Representing Color, A Model for Image Color, Surface Color from Image Color. ",
    "m2": "Module – 2",
    "m2desc": "Linear Filters: \nLinear Filters and Convolution, Shift Invariant Linear Systems, Spatial Frequency and Fourier Transforms, Sampling and Aliasing, Filters as Templates,\nEdge Detection: \nNoise, Estimating Derivatives, Detecting Edges, \nTexture:\n Representing Texture, Analysis (and Synthesis) Using Oriented Pyramids, Application: Synthesis by Sampling Local Models, Shape from Texture.",
    "m3": "Module – 3",
    "m3desc": "The Geometry of Multiple Views: Two Views, \nStereopsis:\nReconstruction, Human Stereposis, Binocular Fusion, Using More Cameras, \nSegmentation by Clustering: \nWhat Is Segmentation?, Human Vision: Grouping and Getstalt, Applications: Shot Boundary Detection and Background Subtraction, Image Segmentation by Clustering Pixels, Segmentation by Graph-Theoretic Clustering, ",
    "m4": "Module – 4",
    "m4desc": "Segmentation by Fitting a Model: \n The Hough Transform, Fitting Lines, Fitting Curves,  Fitting as a Probabilistic Inference Problem, Robustness, \nSegmentation and Fitting Using Probabilistic Methods:\n Missing Data Problems, Fitting, and Segmentation, The EM Algorithm in Practice,\nTracking With Linear Dynamic Models:\nProblem, Linear Dynamic Models, Kalman Filtering, Data Association, Applications and Examples.  Tracking as an Abstract Inference ",
    "m5": "Module – 5",
    "m5desc": "Geometric Camera Models:\nElements of Analytical Euclidean Geometry, Camera Parameters and the Perspective Projection, Affine Cameras and Affine Projection Equations,\nGeometric Camera Calibration: \nLeast-Squares Parameter Estimation, A Linear Approach to Camera Calibration, Taking Radial Distortion into Account, Analytical  Photogrammetry, An Application: Mobile Robot Localization, \nModel- Based Vision: \nInitial Assumptions, Obtaining Hypotheses by Pose Consistency, Obtaining Hypotheses by pose Clustering, Obtaining Hypotheses Using Invariants, Verification, Application: Registration In Medical Imaging Systems, Curved Surfaces and Alignment. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. David A. Forsyth and Jean Ponce: Computer Vision – A Modern Approach, PHI Learning (Indian Edition), 2009.\n\n Reference Books:\n1. E. R. Davies: Computer and Machine Vision – Theory, Algorithms and Practicalities, Elsevier (Academic Press), 4th edition, 2013. ",
    "__v": 0
  },
  {
    "_id": "5ed8f3f91f006923206b1f74",
    "subcode": "17CS753 ",
    "subname": "DIGITAL IMAGE PROCESSING ",
    "m1": "Module – 1",
    "m1desc": "Introduction :\nFundamental Steps in Digital Image Processing, Components of an Image Processing System, Sampling and Quantization, Representing Digital Images (Data structure), Some Basic Relationships Between Pixels- Neighbors and Connectivity of pixels in image, Applications of Image Processing: Medical imaging, Robot vision, Character recognition, Remote Sensing. ",
    "m2": "Module – 2",
    "m2desc": "Image Enhancement In The Spatial Domain: \nSome Basic Gray Level Transformations, Histogram Processing, Enhancement Using Arithmetic/Logic Operations, Basics of Spatial Filtering, Smoothing Spatial Filters, Sharpening Spatial Filters, Combining Spatial Enhancement Methods.",
    "m3": "Module – 3",
    "m3desc": "Image Enhancement In Frequency Domain:\nIntroduction, Fourier Transform, Discrete Fourier Transform (DFT), properties of DFT , Discrete Cosine Transform (DCT), Image filtering in frequency domain. ",
    "m4": "Module – 4",
    "m4desc": "Image  Segmentation: \n Introduction, Detection of isolated points, line detection, Edge detection, Edge linking, Region based segmentation- Region growing, split and merge technique, local processing, regional processing, Hough transform, Segmentation using Threshold. ",
    "m5": "Module – 5",
    "m5desc": "Image Compression:\n Introduction, coding Redundancy , Inter-pixel redundancy, image compression model, Lossy and Lossless compression, Huffman Coding, Arithmetic Coding, LZW coding, Transform Coding, Sub-image size selection, blocking, DCT implementation using FFT, Run length coding. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Rafael C G., Woods R E. and Eddins S L, Digital Image Processing, Prentice Hall, 3rd edition, 2008.\n\n Reference Books:\n 1. Milan Sonka,”Image Processing, analysis and Machine Vision”, Thomson Press India Ltd, Fourth Edition.\n 2. Fundamentals of Digital Image Processing- Anil K. Jain, 2nd Edition, Prentice Hall of India.\n 3. S. Sridhar , Digital Image Processing, Oxford University Press, 2nd Ed, 2016.  ",
    "__v": 0
  },
  {
    "_id": "5ed8f4bc1f006923206b1f75",
    "subcode": "17CS754 ",
    "subname": "STORAGE AREA NETWORKS ",
    "m1": "Module – 1",
    "m1desc": "Storage System: Introduction to evolution of storage architecture, key data center elements, virtualization, and cloud computing. Key data center elements – Host (or compute), connectivity, storage, and application in both classic and virtual environments. RAID implementations, techniques, and levels along with the impact of RAID on application performance.Components of intelligent storage systems and virtual storage provisioning and intelligent storage system implementations.",
    "m2": "Module – 2",
    "m2desc": "Storage Networking Technologies and Virtualization :Fibre Channel SAN components, connectivity options, and topologies including access protection mechanism ‘zoning”, FC protocol stack, addressing and operations, SAN-based virtualization and VSAN technology, iSCSI and FCIP protocols for storage access over IP network, Converged protocol FCoE and its components, Network Attached Storage (NAS) - components, protocol and operations, File level storage virtualization, Object based storage and unified storage platform. ",
    "m3": "Module – 3",
    "m3desc": "Backup, Archive, and Replication:\n This unit focuses on information availability and business continuity solutions in both virtualized and non-virtualized environments. Business continuity terminologies, planning and solutions, Clustering and multipathing architecture to avoid single points of failure, Backup and recovery - methods, targets and topologies, Data deduplication and backup in virtualized environment, Fixed content and data archive, Local replication in classic and virtual environments, Remote replication in classic and virtual environments, Three-site remote replication and continuous data protection",
    "m4": "Module – 4",
    "m4desc": "Cloud Computing Characteristics and benefits:\nThis unit focuses on the business drivers, definition, essential characteristics, and phases of journey to the Cloud.  ,Business drivers for Cloud computing, Definition of Cloud computing, Characteristics of Cloud computing, Steps involved in transitioning from Classic data center to Cloud computing environment Services and deployment models, Cloud infrastructure components, Cloud migration considerations ",
    "m5": "Module – 5",
    "m5desc": "Securing and Managing Storage Infrastructure: \nThis chapter focuses on framework and domains of storage security along with covering security. implementation at storage networking.  Security threats, and countermeasures in various domains Security solutions for FC-SAN, IP-SAN and NAS environments, Security in virtualized and cloud environments, Monitoring and managing various information infrastructure components in classic and virtual environments, Information lifecycle management (ILM) and storage tiering, Cloud service management activities ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Information Storage and Management,Author :EMC Education Services, Publisher: Wiley.\n 2. Storage Virtualization, Author: Clark Tom,  Publisher: Addison Wesley Publishing Company. ",
    "__v": 0
  }
]
