[
  {
    "_id": "5ed8f90e1f006923206b1f76",
    "subcode": "17CS81 ",
    "subname": "INTERNET OF THINGS TECHNOLOGY",
    "m1": "Module – 1",
    "m1desc": "What is IoT, Genesis of IoT, IoT and Digitization, IoT Impact, Convergence of IT and IoT, IoT Challenges, IoT Network Architecture and Design, Drivers Behind New Network Architectures, Comparing IoT Architectures, A Simplified IoT Architecture, The Core IoT Functional Stack, IoT Data Management and Compute Stack.  ",
    "m2": "Module – 2",
    "m2desc": "Smart Objects: The “Things” in IoT, Sensors, Actuators, and Smart Objects, Sensor Networks, Connecting Smart Objects, Communications Criteria, IoT Access Technologies. ",
    "m3": "Module – 3",
    "m3desc": "IP as the IoT Network Layer, The Business Case for IP, The need for Optimization, Optimizing IP for IoT, Profiles and Compliances, Application Protocols for IoT, The Transport Layer, IoT Application Transport Methods",
    "m4": "Module – 4",
    "m4desc": "Data and Analytics for IoT, An Introduction to Data Analytics for IoT, Machine Learning, Big Data Analytics Tools and Technology, Edge Streaming Analytics, Network Analytics, Securing IoT, A Brief History of OT Security, Common Challenges in OT Security, How IT and OT Security Practices and Systems Vary, Formal Risk Analysis Structures: OCTAVE and FAIR, The Phased Application of Security in an Operational Environment",
    "m5": "Module – 5",
    "m5desc": "IoT Physical Devices and Endpoints - Arduino UNO:  Introduction to Arduino, Arduino UNO, Installing the Software, Fundamentals of Arduino Programming.    IoT Physical Devices and Endpoints - RaspberryPi: Introduction to RaspberryPi, About the RaspberryPi Board: Hardware Layout, Operating Systems on RaspberryPi, Configuring RaspberryPi, Programming RaspberryPi with Python, Wireless Temperature Monitoring System Using Pi, DS18B20 Temperature Sensor, Connecting Raspberry Pi via SSH, Accessing Temperature from DS18B20 sensors, Remote access to RaspberryPi, Smart and Connected Cities, An IoT Strategy for Smarter Cities, Smart City IoT Architecture, Smart City Security Architecture, Smart City Use-Case Examples. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text Books:\n 1. David Hanes, Gonzalo Salgueiro, Patrick Grossetete, Robert Barton, Jerome Henry,'IoT Fundamentals: Networking Technologies, Protocols, and Use Cases for the Internet of Things', 1stEdition, Pearson Education (Cisco Press Indian Reprint). \n 2. Srinivasa K G, 'Internet of Things',CENGAGE Leaning India, 2017 \n\nReference Books: \n1. Vijay Madisetti and ArshdeepBahga, “Internet of Things (A Hands-on-Approach)”, 1stEdition, VPT, 2014.\n2. Raj Kamal, “Internet of Things: Architecture and Design Principles”, 1st Edition, McGraw Hill Education, 2017. ",
    "__v": 0
  },
  {
    "_id": "5ed8fa121f006923206b1f78",
    "subcode": "17CS82 ",
    "subname": "BIG DATA ANALYTICS",
    "m1": "Module – 1",
    "m1desc": "Hadoop Distributed File System Basics, Running Example Programs and Benchmarks, Hadoop MapReduce Framework, MapReduce Programming ",
    "m2": "Module – 2",
    "m2desc": "Essential Hadoop Tools, Hadoop YARN Applications, Managing Hadoop with Apache Ambari, Basic Hadoop Administration Procedures ",
    "m3": "Module – 3",
    "m3desc": "Business Intelligence Concepts and Application, Data Warehousing, Data Mining, Data Visualization ",
    "m4": "Module – 4",
    "m4desc": "Decision Trees, Regression, Artificial Neural Networks, Cluster Analysis, Association Rule Mining ",
    "m5": "Module – 5",
    "m5desc": "Text Mining, Naïve-Bayes Analysis, Support Vector Machines, Web Mining, Social Network Analysis ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Douglas Eadline,'Hadoop 2 Quick-Start Guide: Learn the Essentials of Big Data Computing in the Apache Hadoop 2 Ecosystem', 1stEdition, Pearson Education, 2016.\n 2. Anil Maheshwari, “Data Analytics”, 1st Edition, McGraw Hill Education, 2017.\n\nReference Books:\n 1) Tom White, “Hadoop: The Definitive Guide”, 4th Edition, O’Reilly Media, 2015.\n\n 2) Boris Lublinsky, Kevin T.Smith, Alexey Yakubovich,'Professional HadoopSolutions', 1stEdition, Wrox Press\n3) Eric Sammer,'Hadoop Operations: A Guide for Developers and Administrators',1stEdition, O'Reilly Media  ",
    "__v": 0
  },
  {
    "_id": "5ed8fd311f006923206b1f79",
    "subcode": "17CS831 ",
    "subname": "HIGH PERFORMANCE COMPUTING ",
    "m1": "Module – 1",
    "m1desc": "Introduction: Computational Science and Engineering: \nComputational Science and Engineering Applications; characteristics and requirements, Review of Computational Complexity, Performance: metrics and measurements, Granularity and Partitioning,  Locality: temporal/spatial/stream/kernel, Basic methods for parallel programming, Real-world case studies (drawn from multiscale, multi-discipline applications) .",
    "m2": "Module – 2",
    "m2desc": "High-End Computer Systems : \nMemory Hierarchies, Multi-core Processors: Homogeneous and Heterogeneous, Shared-memory Symmetric Multiprocessors, Vector Computers, Distributed Memory Computers, Supercomputers and Petascale Systems, Application Accelerators / Reconfigurable Computing, Novel computers: Stream, multithreaded, and purpose-built.",
    "m3": "Module – 3",
    "m3desc": "Parallel Algorithms:\nParallel models: ideal and real frameworks, Basic Techniques: Balanced Trees, Pointer Jumping, Divide and Conquer, Partitioning, Regular Algorithms: Matrix operations and Linear Algebra, Irregular Algorithms: Lists, Trees, Graphs,  Randomization: Parallel Pseudo-Random Number Generators, Sorting, Monte Carlo techniques.",
    "m4": "Module – 4",
    "m4desc": "Parallel Programming:\n Revealing concurrency in applications, Task and Functional Parallelism, Task Scheduling, Synchronization Methods, Parallel Primitives (collective operations), SPMD Programming (threads, OpenMP, MPI),  I/O and File Systems, Parallel Matlabs (Parallel Matlab, Star-P, Matlab MPI), Partitioning Global Address Space (PGAS) languages (UPC, Titanium, Global Arrays) ",
    "m5": "Module – 5",
    "m5desc": "Achieving Performance: \nMeasuring performance, Identifying performance bottlenecks, Restructuring applications for deep memory hierarchies, Partitioning applications for heterogeneous resources, using existing libraries, tools, and frameworks",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Introduction to Parallel Computing, AnanthGrama, Anshul Gupta, George Karypis, and Vipin Kumar, 2nd edition, Addison-Welsey, 2003.\n 2. Petascale Computing: Algorithms and Applications, David A. Bader (Ed.), Chapman & Hall/CRC Computational Science Series, 2007\n\nReference Books:\n 1. Grama, A. Gupta, G. Karypis, V. Kumar, An Introduction to Parallel Computing, Design and Analysis of Algorithms: 2/e, Addison-Wesley, 2003.\n 2. G.E. Karniadakis, R.M. Kirby II, Parallel Scientific Computing in C++ and MPI: A Seamless Approach to Parallel Algorithms and their Implementation, Cambridge University Press,2003.\n 3. Wilkinson and M. Allen, Parallel Programming: Techniques and Applications Using Networked Workstations and Parallel Computers, 2/E, Prentice Hall, 2005. 4. M.J. Quinn, Parallel Programming in C with MPI and OpenMP, McGraw-Hill, 2004.\n 5. G.S. Almasi and A. Gottlieb, Highly Parallel Computing, 2/E, Addison-Wesley, 1994.\n 6. David Culler Jaswinder Pal Singh,'Parallel Computr Architecture: A hardware/Software Approach', Morgan Kaufmann, 1999. \n 7. Kai Hwang, 'Scalable Parallel Computing', McGraw Hill 1998 ",
    "__v": 0
  },
  {
    "_id": "5ed8fdcd1f006923206b1f7a",
    "subcode": "17CS832 ",
    "subname": "USER INTERFACE DESIGN ",
    "m1": "Module – 1",
    "m1desc": "The User Interface-Introduction, Overview, The importance of user interface – Defining the user interface, The importance of Good design, Characteristics of graphical and web user interfaces, Principles of user interface design",
    "m2": "Module – 2",
    "m2desc": "The User Interface Design process- Obstacles, Usability, Human characteristics in Design, Human Interaction speeds, Business functions-Business definition and requirement analysis, Basic business functions, Design standards. ",
    "m3": "Module – 3",
    "m3desc": "System menus and navigation schemes- Structures of menus, Functions of menus, Contents of menus, Formatting of menus, Phrasing the menu, Selecting menu choices, Navigating menus, Kinds of graphical menus. ",
    "m4": "Module – 4",
    "m4desc": "Windows - Characteristics, Components of window, Window presentation styles, Types of window, Window management, Organizing window functions, Window operations, Web systems, Characteristics of device based controls. ",
    "m5": "Module – 5",
    "m5desc": "Screen based controls- Operable control, Text control, Selection control, Custom control, Presentation control, Windows Tests-prototypes, kinds of tests. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text Book:\n 1. Wilbert O. Galitz, “The Essential Guide to User Interface Design”, John Wiley & Sons, Second Edition 2002.\n\nReference Books: \n1. Ben Sheiderman, “Design the User Interface”, Pearson Education, 1998.\n 2. Alan Cooper, ”The Essential of User Interface Design”, Wiley- Dream Tech Ltd.,2002.  ",
    "__v": 0
  },
  {
    "_id": "5ed8fe681f006923206b1f7b",
    "subcode": "17CS833 ",
    "subname": "NETWORK MANAGEMENT ",
    "m1": "Module – 1",
    "m1desc": "Introduction:\n Analogy of Telephone Network Management, Data and Telecommunication Network Distributed computing Environments, TCP/IPBased Networks: The Internet and Intranets, Communications Protocols and Standards- Communication Architectures, Protocol Layers and Services; Case Histories of Networking and Management – The Importance of topology , Filtering Does Not Reduce Load on Node, Some Common Network Problems; Challenges of Information Technology Managers, Network Management: Goals, Organization, and Functions- Goal of Network Management, Network Provisioning, Network Operations and the NOC, Network Installation and Maintenance; Network and System Management, Network Management System platform, Current Status and Future of Network Management.",
    "m2": "Module – 2",
    "m2desc": "Basic Foundations: Standards, Models, and Language: Network Management Standards, Network Management Model, Organization Model, Information Model – Management Information Trees, Managed Object Perspectives, Communication Model; ASN.1- Terminology, Symbols, and Conventions, Objects and Data Types, Object Names, An Example of ASN.1 from ISO 8824; Encoding Structure; Macros, Functional Model. ",
    "m3": "Module – 3",
    "m3desc": "SNMPv1 Network Management: Managed Network: The History of SNMP Management, Internet Organizations and standards, Internet Documents, The SNMP Model, The Organization Model, System Overview. The Information Model – Introduction, The Structure of Management Information, Managed Objects, Management Information Base. The SNMP Communication Model – The SNMP Architecture, Administrative Model, SNMP Specifications, SNMP Operations, SNMP MIB Group, Functional Model SNMP Management – RMON: Remote Monitoring, RMON SMI and MIB, RMONI1- RMON1 Textual Conventions, RMON1 Groups and Functions, Relationship Between Control and Data Tables, RMON1 Common and Ethernet Groups, RMON Token Ring Extension Groups, RMON2 – The RMON2 Management Information Base, RMON2 Conformance Specifications.",
    "m4": "Module – 4",
    "m4desc": "Broadband Access Networks, Broadband Access Technology; HFCT Technology: The Broadband LAN, The Cable Modem, The Cable Modem Termination System, The HFC Plant, The RF Spectrum for Cable Modem; Data Over Cable, Reference Architecture; HFC Management – Cable Modem and CMTS Management, HFC Link Management, RF Spectrum Management, DSL Technology; Asymmetric Digital Subscriber Line Technology – Role of the ADSL Access Network in an Overall Network, ADSL Architecture, ADSL Channeling Schemes, ADSL Encoding Schemes; ADSL Management – ADSL Network Management Elements, ADSL Configuration Management, ADSL Fault Management, ADSL Performance Management, SNMP-Based ADSL Line MIB, MIB Integration with Interfaces Groups in MIB-2, ADSL Configuration Profiles",
    "m5": "Module – 5",
    "m5desc": "Network Management Applications: Configuration Management- Network Provisioning, Inventory Management, Network Topology, Fault Management- Fault Detection, Fault Location and Isolation 24 Techniques, Performance Management – Performance Metrics, Data Monitoring, Problem Isolation, Performance Statistics; Event Correlation Techniques – Rule-Based Reasoning, Model-Based Reasoning, CaseBased Reasoning, Codebook correlation Model, State Transition Graph Model, Finite State Machine Model, Security Management – Policies and Procedures, Security Breaches and the Resources Needed to Prevent Them, Firewalls, Cryptography, Authentication and Authorization, Client/Server Authentication Systems, Messages Transfer Security, Protection of Networks from Virus Attacks, Accounting Management, Report Management, Policy- Based Management, Service Level Management",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text Book:\n Mani Subramanian: Network Management- Principles and Practice, 2nd Pearson Education, 2010.\n\nReference Books:\n 1. J. Richard Burke: Network management Concepts and Practices: a Hands-On Approach, PHI, 2008.",
    "__v": 0
  },
  {
    "_id": "5ed8ff931f006923206b1f7c",
    "subcode": "17CS834 ",
    "subname": "SYSTEM MODELLING AND SIMULATION ",
    "m1": "Module – 1",
    "m1desc": "Introduction: \n When simulation is the appropriate tool and when it is not appropriate, Advantages and disadvantages of Simulation; Areas of application, Systems and system environment; Components of a system; Discrete and continuous systems, Model of a system; Types of Models, Discrete-Event System Simulation Simulation examples: Simulation of queuing systems.\nGeneral Principles, Simulation Software:\nConcepts in Discrete-Event Simulation. The Event-Scheduling / Time-Advance Algorithm, Manual simulation Using Event Scheduling.",
    "m2": "Module – 2",
    "m2desc": "Statistical Models in Simulation :\n:Review of terminology and concepts, Useful statistical models,Discrete distributions. Continuous distributions,Poisson process, Empirical distributions.\nQueuing Models:\nof queuing systems,Queuing notation,Long-run measures of performance of queuing systems,Long-run measures of performance of queuing systems cont…,Steady-state behavior of M/G/1 queue, Networks of queues.",
    "m3": "Module – 3",
    "m3desc": "Random-NumberGeneration:\nProperties of random numbers; Generation of pseudo-random numbers, Techniques for generating random numbers,Tests for Random Numbers, \nRandom-Variate Generation:\n ,Inverse transform technique Acceptance-Rejection technique.",
    "m4": "Module – 4",
    "m4desc": "Input Modeling: Data Collection; Identifying the distribution with data, Parameter estimation, Goodness of Fit Tests, Fitting a non-stationary Poisson process, Selecting input models without data, Multivariate and Time-Series input models. \nEstimation of Absolute Performance: \n Types of simulations with respect to output analysis ,Stochastic nature of output data, Measures of performance and their estimation, Cont..",
    "m5": "Module – 5",
    "m5desc": "Measures of performance and their estimation,Output analysis for terminating simulations Continued..,Output analysis for steady-state simulations.\n Verification, Calibration And Validation\n:Optimization: Model building, verification and validation, Verification of simulation models, Verification of simulation models,Calibration and validation of models, Optimization via Simulation. ",
    "descname": "Text  Books and Reference Books:",
    "descdata": "Text  Books:\n 1. Jerry Banks, John S. Carson II, Barry L. Nelson, David M. Nicol:  Discrete-Event System Simulation, 5 th Edition, Pearson Education,  2010.\n\n Reference Books:\n 1. Lawrence  M.  Leemis,  Stephen  K.  Park:  Discrete  –  Event  Simulation: A First Course, Pearson Education, 2006.\n 2. Averill  M.  Law:  Simulation  Modeling  and  Analysis,  4 th Edition,  Tata McGrawHill, 2007",
    "__v": 0
  }
]
